var APP_DATA = {
  "scenes": [
    {
      "id": "0-map66_p360_snc001",
      "name": "MAP66_p360_snc001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.30157359482254975,
          "pitch": 0.25965439457441164,
          "rotation": 0,
          "target": "1-map01_p360_snc002"
        },
        {
          "yaw": 3.0333535269365264,
          "pitch": 0.14827971611220292,
          "rotation": 0,
          "target": "61-map16_p360_snc002"
        },
        {
          "yaw": 2.0089766734211656,
          "pitch": 0.2520127403815877,
          "rotation": 0,
          "target": "48-map65_p360_snc002"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "1-map01_p360_snc002",
      "name": "MAP01_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -1.7168521068532758,
        "pitch": -0.17461646265181585,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": -0.14122353760372874,
          "pitch": -0.0020504622443766607,
          "rotation": 0,
          "target": "2-map25_p360_snc002"
        },
        {
          "yaw": -1.3347144213887674,
          "pitch": 0.046363110311457234,
          "rotation": 0,
          "target": "22-map02_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.1415915187379433,
          "pitch": -0.11585108162421598,
          "title": "ประตูทรงพล&nbsp;",
          "text": "เป็นประตูทางเข้าหลักของมหาวิทยาลัยศิลปากร วิทยาเขตพระราชวังสนามจันทร์ จังหวัดนครปฐม ตั้งอยู่ติดกับถนนมาลัยแมน ซึ่งเป็นเส้นทางสำคัญที่เชื่อมต่อเมืองนครปฐมกับพื้นที่โดยรอบ"
        }
      ]
    },
    {
      "id": "2-map25_p360_snc002",
      "name": "MAP25_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -1.559882614049588,
        "pitch": -0.09576033390679761,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": 0.08892949227059432,
          "pitch": -0.013004473570326525,
          "rotation": 0,
          "target": "3-map32_p360_snc002"
        },
        {
          "yaw": 3.124157201650984,
          "pitch": -0.008148037441591427,
          "rotation": 0,
          "target": "1-map01_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.5492634828732328,
          "pitch": -0.03887801562299842,
          "title": "ศูนย์บริการสุขภาพ",
          "text": "เดิมชื่อ “สถานปฏิบัติการเภสัชกรรมชุมชน เภสัชศาลา” หรือเรียกสั้นๆ ว่า “เภสัชศาลา” ปัจจุบันได้ปรับเปลี่ยนชื่อเป็น ศูนย์บริการสุขภาพ ประกอบด้วย 1) คลินิกเวชกรรมชุมชนอบอุ่น ให้บริการตรวจรักษาโรคโดยแพทย์ และพยาบาล 2) เภสัชศาลา ให้บริการจำหน่ายยาและเวชภัณฑ์ สำหรับบุคคลทั่วไป และ 3) บริการแพทย์แผนไทย ให้บริการนวดเพื่อสุขภาพ และการแพทย์แผนไทย ให้บริการด้านสุขภาพกับนักศึกษา บุคลากรภายในมหาวิทยาลัยและบุคคลทั่วไป สามารถเข้าใช้บริการได้ มีการให้บริการโดยบุคลากรทางการแพทย์ อาจารย์เภสัชกร และเจ้าหน้าที่ทางสุขภาพที่พร้อมให้คำปรึกษาในเรื่องของสุขภาพ และการดูแลรักษาต่างๆ&nbsp;"
        }
      ]
    },
    {
      "id": "3-map32_p360_snc002",
      "name": "MAP32_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -0.6828153676909459,
        "pitch": 0.2622871729377305,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.121651066263162,
          "pitch": -0.011678531540766812,
          "rotation": 0,
          "target": "2-map25_p360_snc002"
        },
        {
          "yaw": 1.2271346111234465,
          "pitch": 0.002040612893980054,
          "rotation": 0,
          "target": "4-map57_p360_snc002"
        },
        {
          "yaw": -0.6010729236476635,
          "pitch": 0.02304709235069069,
          "rotation": 0,
          "target": "13-map47_p360_snc002"
        },
        {
          "yaw": 1.5569845468529149,
          "pitch": 0.02243178276863489,
          "rotation": 0,
          "target": "15-map59_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.9027666630711053,
          "pitch": -0.30900514337074725,
          "title": "ประตูสาธิต",
          "text": "เป็นประตูทางเข้ามหาวิทยาลัยศิลปากร วิทยาเขตพระราชวังสนามจันทร์ จากบริเวณสี่แยกสนามจันทร์"
        },
        {
          "yaw": -1.5484859467912475,
          "pitch": -0.03087997225546424,
          "title": "เทวาลัยพระพิฆเนศ (โรงเรียนสาธิต)",
          "text": "<div>ตั้งอยู่บริเวณประตูทางเข้าโรงเรียนสาธิตมหาวิทยาลัยศิลปากร (มัธยมศึกษา)</div><div><br></div>"
        }
      ]
    },
    {
      "id": "4-map57_p360_snc002",
      "name": "MAP57_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 2.38362930769725,
        "pitch": -0.00415257306487149,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.07273194469476785,
          "pitch": 0.033980902305073,
          "rotation": 0,
          "target": "3-map32_p360_snc002"
        },
        {
          "yaw": 2.9042647008732008,
          "pitch": 0.019622867133191946,
          "rotation": 0,
          "target": "5-map56_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.5443858186692987,
          "pitch": -0.21182049295107674,
          "title": "สถาบันวัฒนธรรมภูมิภาคตะวันตก (ทับเจริญ)&nbsp;",
          "text": "อาคารประวัติศาสตร์ซึ่งเคยเป็นบ้านพักของเจ้าพระยารามราฆพ (สมุหราชองครักษ์ในรัชกาลที่ 6) ต่อมาใช้เป็นจวนผู้ว่าราชการจังหวัดนครปฐม ปัจจุบันอยู่ในความดูแลของมหาวิทยาลัยศิลปากร และใช้เป็นที่ตั้งของสถาบันวัฒนธรรมภูมิภาคตะวันตก"
        }
      ]
    },
    {
      "id": "5-map56_p360_snc002",
      "name": "MAP56_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 1.5866915626532387,
        "pitch": 0.2592763933163038,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.5279398050397681,
          "pitch": 0.01689399393178448,
          "rotation": 0,
          "target": "4-map57_p360_snc002"
        },
        {
          "yaw": 1.5225796543397614,
          "pitch": 0.0011055548230753942,
          "rotation": 0,
          "target": "7-map55_p360_snc002"
        },
        {
          "yaw": 1.1882848148419285,
          "pitch": 0.004524699679976152,
          "rotation": 0,
          "target": "9-map30_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.5401434776640421,
          "pitch": -0.25864589619131984,
          "title": "ประตูทับแก้ว",
          "text": "เดิมเคยเป็นประตูใหญ่ของฝั่ง ศิลปากร–ทับแก้ว ซึ่งเป็นชื่อที่ใช้เรียกวิทยาเขตแห่งนี้ ปัจจุบันบริเวณประตูทับแก้วเป็นอีกจุดหนึ่งที่ใช้สำหรับการเข้า–ออกมหาวิทยาลัย และเป็นพื้นที่ที่สะท้อนความทรงจำทางประวัติศาสตร์ของนักศึกษาและศิษย์เก่าที่ใช้เรียกวิทยาเขตสนามจันทร์ของมหาวิทยาลัยศิลปากร"
        },
        {
          "yaw": 0.6701255363291327,
          "pitch": -0.7881201854789524,
          "title": "คณะศึกษาศาสตร์ อาคารโสมสวลี",
          "text": "ประกอบด้วย โรงอาหาร ศูนย์ออกกำลังกาย SU.ED. Fitness Center และห้องประชุม ‘ไทยประกันชีวิต’&nbsp;"
        },
        {
          "yaw": 2.28315628495149,
          "pitch": -0.6070197712853638,
          "title": "หอพักทับแก้ว 1 (หอชาย)",
          "text": "จัดสร้างขึ้นเพื่อรองรับนักศึกษาชายในช่วงที่มหาวิทยาลัยขยายการเรียนการสอนมายังวิทยาเขตสนามจันทร์ โดยตั้งชื่อตามคำว่า “ทับแก้ว” ซึ่งเป็นชื่อที่ใช้เรียกพื้นที่ของวิทยาเขตสนามจันทร์ในช่วงเริ่มพัฒนามหาวิทยาลัย"
        },
        {
          "yaw": 3.125117777293437,
          "pitch": -0.0031576529349344185,
          "title": "หน่วยยานพาหนะ",
          "text": "หน่วยงานที่ให้บริการด้านการเดินทางและการขนส่งของมหาวิทยาลัยศิลปากร วิทยาเขตพระราชวังสนามจันทร์ ทำหน้าที่บริหารจัดการยานพาหนะของมหาวิทยาลัย เพื่อสนับสนุนการปฏิบัติงานของบุคลากร นักศึกษา และกิจกรรมต่าง ๆ ของมหาวิทยาลัยอย่างมีประสิทธิภาพ"
        }
      ]
    },
    {
      "id": "6-map31_p360_snc002",
      "name": "MAP31_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -2.740763619392478,
        "pitch": -0.1356406518030795,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": 0.28077329724926514,
          "pitch": -0.011254426270198792,
          "rotation": 0,
          "target": "10-map48_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.4508584323574887,
          "pitch": -0.2296064395793067,
          "title": "อาคารศึกษาศาสตร์ 1&nbsp;",
          "text": "ประกอบด้วย ภาควิชาการบริหารการศึกษา ภาควิชาการศึกษาตลอดชีวิต ภาควิชาพื้นฐานทางการศึกษา ภาควิชาหลักสูตรและวิธีสอน ภาควิชาการสอนภาษานานาชาติ และภาควิชาศิลปศึกษา"
        }
      ]
    },
    {
      "id": "7-map55_p360_snc002",
      "name": "MAP55_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 0.5029673170997828,
        "pitch": -0.028953334872955594,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.5506505631674123,
          "pitch": 0.03050109065725337,
          "rotation": 0,
          "target": "5-map56_p360_snc002"
        },
        {
          "yaw": 1.7168608180350056,
          "pitch": 0.02785465475872506,
          "rotation": 0,
          "target": "8-map29_p360_snc002"
        },
        {
          "yaw": 0.09076918919643795,
          "pitch": 0.037203147088188615,
          "rotation": 0,
          "target": "12-map54_p360_snc002"
        },
        {
          "yaw": -1.3669215629206786,
          "pitch": -0.0028669951111890413,
          "rotation": 0,
          "target": "10-map48_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.9881012855592886,
          "pitch": -0.017184913450908113,
          "title": "อาคารศึกษาศาสตร์ 3&nbsp;",
          "text": "อาคารหลักของคณะศึกษาศาสตร์ ภายในประกอบด้วยสำนักงานคณบดี ศูนย์ความเป็นเลิศด้านการเรียนการสอน (CTLE) ศูนย์วิจัย นวัตกรรม และพัฒนาวิชาชีพ หม่อมหลวงปิ่น มาลากุล รวมถึง Co-Working Space with AI และห้องประชุมหลวงพ่อวัดไร่ขิงอุปถัมภ์ ซึ่งเป็นพื้นที่สำคัญสำหรับการเรียนรู้ วิจัย และพัฒนาวิชาชีพครู"
        }
      ]
    },
    {
      "id": "8-map29_p360_snc002",
      "name": "MAP29_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.9995864442355327,
          "pitch": 0.027678838698504293,
          "rotation": 0,
          "target": "7-map55_p360_snc002"
        },
        {
          "yaw": 0.6915678553329876,
          "pitch": 0.03828895929861176,
          "rotation": 0,
          "target": "11-map28_p360_snc002"
        },
        {
          "yaw": -1.775105596474205,
          "pitch": -0.013087705544503336,
          "rotation": 0,
          "target": "12-map54_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.7698514112089505,
          "pitch": -0.6091195168292742,
          "title": "หอพักทับแก้ว 2 (หอชาย)",
          "text": "สร้างขึ้นเพื่อรองรับการขยายตัวของจำนวนนักศึกษาชายในช่วงที่มหาวิทยาลัยพัฒนาพื้นที่วิทยาเขตแห่งนี้"
        }
      ]
    },
    {
      "id": "9-map30_p360_snc002",
      "name": "MAP30_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.65698288555566,
          "pitch": -0.013487700359597454,
          "rotation": 0,
          "target": "5-map56_p360_snc002"
        },
        {
          "yaw": 2.717007680704386,
          "pitch": 0.021557739768924833,
          "rotation": 0,
          "target": "25-map50_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -3.0877382118641474,
          "pitch": -0.22146175021747538,
          "title": "ลานเทวาลัยพระพิฆเนศวร 50 ปี คณะศึกษาศาสตร์",
          "text": "ลานเทวาลัยที่สร้างขึ้นในโอกาสครบรอบ 50 ปี คณะศึกษาศาสตร์ มหาวิทยาลัยศิลปากร เป็นสถานที่สักการะเทพแห่งศิลปวิทยาและความสำเร็จ และเป็นศูนย์รวมจิตใจของชาวศึกษาศาสตร์และศิลปากร"
        }
      ]
    },
    {
      "id": "10-map48_p360_snc002",
      "name": "MAP48_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.8079487141756445,
          "pitch": 0.038480332978156895,
          "rotation": 0,
          "target": "13-map47_p360_snc002"
        },
        {
          "yaw": 1.5612035147163752,
          "pitch": 0.020772786351859196,
          "rotation": 0,
          "target": "6-map31_p360_snc002"
        },
        {
          "yaw": 1.9574995634451948,
          "pitch": 0.017016646271164504,
          "rotation": 0,
          "target": "7-map55_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 3.1211762350563976,
          "pitch": -0.02255226578351177,
          "title": "<p class=\"MsoNormal\" style=\"text-align:justify;text-justify:inter-cluster\"><b><span lang=\"TH\" style=\"font-size:16.0pt;font-family:&quot;TH Sarabun New&quot;,sans-serif;\nmso-ansi-language:EN-US\">อาคารศึกษาศาสตร์ </span></b><b><span style=\"font-size:\n16.0pt;font-family:&quot;TH Sarabun New&quot;,sans-serif;mso-ansi-language:EN-US\">2<o:p></o:p></span></b></p>",
          "text": "ประกอบด้วย ภาควิชาจิตวิทยาและการแนะแนว ภาควิชาเทคโนโลยีการศึกษาและสตูดิโอ"
        }
      ]
    },
    {
      "id": "11-map28_p360_snc002",
      "name": "MAP28_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.954515527541645,
          "pitch": 0.01051207695010703,
          "rotation": 0,
          "target": "8-map29_p360_snc002"
        },
        {
          "yaw": -0.8043144749057749,
          "pitch": -0.03490297550542998,
          "rotation": 0,
          "target": "35-map36_p360_snc002"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "12-map54_p360_snc002",
      "name": "MAP54_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.9376891350407828,
          "pitch": 0.03706490881910618,
          "rotation": 0,
          "target": "7-map55_p360_snc002"
        },
        {
          "yaw": 2.987298420142899,
          "pitch": 0.009825233711945103,
          "rotation": 0,
          "target": "8-map29_p360_snc002"
        },
        {
          "yaw": 0.09744738251010254,
          "pitch": -0.00976862724332861,
          "rotation": 0,
          "target": "26-map51_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.4779037757640232,
          "pitch": -0.16363309733566211,
          "title": "อนุสาวรีย์หม่อมหลวงปิ่นมาลากุล",
          "text": "<div>ศาสตราจารย์ หม่อมหลวงปิ่น มาลากุล ผู้สถาปนามหาวิทยาลัยศิลปากร วิทยาเขตพระราชวังสนามจันทร์&nbsp;</div><div>อนุสาวรีย์ปั้นเเละหล่อด้วยทองเเดงขนาดเท่าครึ่งของคนจริง&nbsp; โดยประติมากร อ. ศราวุธ ดวงจำปา ศิลปินแห่งชาติ สาขาทัศนศิลป์</div><div><br></div>"
        }
      ]
    },
    {
      "id": "13-map47_p360_snc002",
      "name": "MAP47_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.232683840545593,
          "pitch": 0.038641038366588276,
          "rotation": 0,
          "target": "10-map48_p360_snc002"
        },
        {
          "yaw": -0.1649660400039572,
          "pitch": -0.0018206500257758051,
          "rotation": 0,
          "target": "24-map49_p360_snc002"
        },
        {
          "yaw": -3.0744124311261594,
          "pitch": 0.010511433309225993,
          "rotation": 0,
          "target": "3-map32_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.9033946580728607,
          "pitch": -0.024173516625328517,
          "title": "โรงเรียนสาธิต มหาวิทยาลัยศิลปากร (มัธยมศึกษา)",
          "text": "มีฐานะเป็นหน่วยงานของ คณะศึกษาศาสตร์ มุ่งพัฒนาผู้เรียนให้มีความรู้ ทักษะการคิดวิเคราะห์ และความคิดสร้างสรรค์ ผ่านการเรียนรู้ที่เชื่อมโยงกับองค์ความรู้ทางวิชาการ เทคโนโลยี และศิลปวัฒนธรรม"
        },
        {
          "yaw": -0.7661717703799056,
          "pitch": -0.05908099787628274,
          "title": "โรงเรียนสาธิต มหาวิทยาลัยศิลปากร (ปฐมวัยและประถมศึกษา)",
          "text": "จัดการเรียนการสอนในระดับปฐมวัยและประถมศึกษา โดยเน้นการพัฒนาพื้นฐานการเรียนรู้ของเด็กผ่านกิจกรรมสร้างสรรค์ การเรียนรู้แบบบูรณาการ และการพัฒนาทักษะที่จำเป็นสำหรับการศึกษาต่อในระดับที่สูงขึ้น"
        }
      ]
    },
    {
      "id": "14-map60_p360_snc002",
      "name": "MAP60_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -1.5582890575037887,
        "pitch": -0.006018857334654015,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.5704337403559832,
          "pitch": 0.06053493331439341,
          "rotation": 0,
          "target": "15-map59_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.5556356931558781,
          "pitch": -0.6587881794635102,
          "title": "ศูนย์ศิลปวัฒนธรรมเฉลิมพระเกียรติ (หอประชุมใหญ่)&nbsp;",
          "text": "ก่อตั้งขึ้นเนื่องในโอกาสพระราชพิธีมหามงคลเฉลิมพระชนมพรรษา 6 รอบ วันที่ 5 ธันวาคม พ.ศ. 2542 ของพระบาทสมเด็จพระเจ้าอยู่หัว รัชกาลที่ 9 อาคารหลักเป็นห้องประชุมใหญ่ขนาดจุ 1,500 คน มีอาคารรองเป็นเรือนไม้จำนวน 4 หลัง สร้างจากแบบเรือนพักข้าราชบริหารในรัชกาลที่ 6"
        }
      ]
    },
    {
      "id": "15-map59_p360_snc002",
      "name": "MAP59_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -3.05118035873652,
        "pitch": 0.09956209217723178,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": 1.472596291093038,
          "pitch": 0.07097409299302271,
          "rotation": 0,
          "target": "14-map60_p360_snc002"
        },
        {
          "yaw": -3.1270120736758944,
          "pitch": 0.022898439362444734,
          "rotation": 0,
          "target": "16-map58_p360_snc002"
        },
        {
          "yaw": 0.04449727516986712,
          "pitch": -0.010535183226267009,
          "rotation": 0,
          "target": "3-map32_p360_snc002"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "16-map58_p360_snc002",
      "name": "MAP58_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -1.9298395520786524,
        "pitch": -0.019759223322333597,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": 1.7895535417500161,
          "pitch": 0.03892344603646336,
          "rotation": 0,
          "target": "15-map59_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.0038839970141424,
          "pitch": -0.46988666062173934,
          "title": "หอศิลป์สนามจันทร์",
          "text": "พื้นที่จัดแสดงผลงานศิลปกรรมจากการประกวดศิลปกรรมระดับชาติ ภายใต้การดูแลของหอศิลป์มหาวิทยาลัยศิลปากร โดยจัดแสดงในรูปแบบ “คลังสะสมแบบเปิด” ให้ผู้ชมสามารถเข้าชมผลงานได้อย่างใกล้ชิด"
        }
      ]
    },
    {
      "id": "17-map03_p360_snc002",
      "name": "MAP03_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -1.452012044671953,
        "pitch": -0.04823694912144916,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": 2.2640722920450678,
          "pitch": 0.011900911667893865,
          "rotation": 0,
          "target": "22-map02_p360_snc002"
        },
        {
          "yaw": -2.736212205210588,
          "pitch": -0.007859305453699506,
          "rotation": 0,
          "target": "18-map11_p360_snc002"
        },
        {
          "yaw": 0.29839344090991915,
          "pitch": -0.005738759620825817,
          "rotation": 0,
          "target": "23-map26_p360_snc002"
        },
        {
          "yaw": -1.5685302040386127,
          "pitch": -0.020071133545160436,
          "rotation": 0,
          "target": "29-map10_p360_snc002"
        },
        {
          "yaw": -1.3485819327809576,
          "pitch": -0.00820788509611603,
          "rotation": 0,
          "target": "30-map22_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.2202168916463076,
          "pitch": -0.6322440334805233,
          "title": "คณะอักษรศาสตร์ อาคาร 50 ปี",
          "text": "หนึ่งในอาคารเรียนหลักของคณะอักษรศาสตร์ เป็นอาคารหลังแรกบริเวณสี่แยกของถนนหลักหากเข้า-ออกทางประตูทรงพล"
        }
      ]
    },
    {
      "id": "18-map11_p360_snc002",
      "name": "MAP11_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.37883183877543836,
          "pitch": -0.0032059613790806907,
          "rotation": 0,
          "target": "17-map03_p360_snc002"
        },
        {
          "yaw": -2.0316106094699116,
          "pitch": 0.011432832461926168,
          "rotation": 0,
          "target": "19-map12_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.9734873939735706,
          "pitch": -0.04408280723436597,
          "title": "อาคารอเนกประสงค์&nbsp;",
          "text": "เขตที่พักและบ้านพักของบุคลากร"
        },
        {
          "yaw": -0.8899378982370614,
          "pitch": -0.6470493643916786,
          "title": "คณะอักษรศาสตร์ อาคาร 36 ปี&nbsp;",
          "text": "หนึ่งในอาคารเรียนของคณะอักษรศาสตร์ มีห้องประชุม ‘หม่อมหลวงบุญเหลือ เทพยสุวรรณ’ ตามชื่อของคณบดีคนแรกของคณะ"
        }
      ]
    },
    {
      "id": "19-map12_p360_snc002",
      "name": "MAP12_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.5515672525888338,
          "pitch": -0.00036218781796648614,
          "rotation": 0,
          "target": "18-map11_p360_snc002"
        },
        {
          "yaw": -0.7851562395998837,
          "pitch": 0.000945193521207699,
          "rotation": 0,
          "target": "20-map13_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.1693256844890083,
          "pitch": -0.1662273370618923,
          "title": "อาคารทรงพล คณะอักษรศาสตร์",
          "text": "หนึ่งในอาคารเรียนยุคแรกของวิทยาเขตพระราชวังสนามจันทร์ สร้างขึ้นในช่วงเริ่มพัฒนาวิทยาเขต และยังคงใช้สำหรับการเรียนการสอนของคณะอักษรศาสตร์มาจนถึงปัจจุบัน"
        },
        {
          "yaw": -1.2513865360317311,
          "pitch": -0.004741242024488557,
          "title": "อาคารส่วนปาฐอาศรม ‘ประโชติ เปล่งวิทยา’ (ตึกดาว)&nbsp;",
          "text": "อาคารเรียนรวมของคณะเภสัชศาสตร์ ใช้สำหรับการบรรยายในชั้นเรียนขนาดใหญ่ และกิจกรรมทางวิชาการต่างๆ ของคณะเภสัชศาสตร์ ตั้งชื่อตาม รศ. ดร. ภก. ประโชติ เปล่งวิทยา ผู้ก่อตั้งและคณบดีคนแรกของคณะเภสัชศาสตร์ มหาวิทยาลัยศิลปากร"
        },
        {
          "yaw": -2.7221533483094458,
          "pitch": -0.056355232109343234,
          "title": "อาคารปฏิบัติการควบคุมและประเมินคุณภาพทางเภสัชศาสตร์และวิทยาศาสตร์เทคโนโลยี (ตึก 6 ชั้น)",
          "text": "ด้วยตำแหน่งที่ตั้งและการใช้งานที่เชื่อมต่อกับอาคารส่วนปาฐอาศรม “ประโชติ เปล่งวิทยา” อาคารเปรียบเสมือนอีกหนึ่งศูนย์กลางการเรียนรู้ และเป็นสถานที่ทำการวิจัยของนักศึกษาระดับบัณฑิตศึกษา และอาจารย์ในคณะเภสัชศาสตร์"
        }
      ]
    },
    {
      "id": "20-map13_p360_snc002",
      "name": "MAP13_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -2.49647926598546,
        "pitch": -0.10308494096758025,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.4717556573845485,
          "pitch": -0.01933592463627143,
          "rotation": 0,
          "target": "19-map12_p360_snc002"
        },
        {
          "yaw": -2.685832257885181,
          "pitch": 0.008323309034413029,
          "rotation": 0,
          "target": "21-map14_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.058450410371254,
          "pitch": -0.09542517093482772,
          "title": "อาคารปฏิบัติการเทคโนโลยีเภสัชกรรม (ตึกฟาร์เทค)",
          "text": "อาคารปฏิบัติการ 2 ชั้นของคณะเภสัชศาสตร์ ใช้สำหรับการเรียนการสอนภาคปฏิบัติทางเภสัชศาสตร์ และการวิจัยด้านเทคโนโลยีเภสัชกรรมและการวิจัยและพัฒนาผลิตภัณฑ์ยา"
        },
        {
          "yaw": -0.8184133957944049,
          "pitch": -0.01172092863401275,
          "title": "อาคารปฎิบัติการเภสัชพฤกษศาสตร์ (เรือนเพาะชำ)",
          "text": "พื้นที่ปฏิบัติการของคณะเภสัชศาสตร์สำหรับการศึกษาและวิจัยด้านเภสัชพฤกษศาสตร์ ประกอบด้วยเรือนเพาะชำและแปลงปลูกพืชสมุนไพร แหล่งการเรียนรู้ที่ใช้ในการเรียนการสอน การประชุมกลุ่มย่อย และการศึกษาพืชที่มีคุณค่าทางยา"
        }
      ]
    },
    {
      "id": "21-map14_p360_snc002",
      "name": "MAP14_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.1034882902098175,
          "pitch": 0.00042711571026465833,
          "rotation": 0,
          "target": "20-map13_p360_snc002"
        },
        {
          "yaw": 2.898627961096561,
          "pitch": 0.0023475592725255012,
          "rotation": 0,
          "target": "42-map39_p360_snc002"
        },
        {
          "yaw": 0.3988489800999453,
          "pitch": 0.018662316220819264,
          "rotation": 0,
          "target": "47-map42_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.5300168801612983,
          "pitch": -0.022854956816470207,
          "title": "อาคารนำร่องศูนย์ภูมิปัญญาและเทคโนโลยีทางเภสัชศาสตร์และสุขภาพ",
          "text": "อาคารของคณะเภสัชศาสตร์ที่ใช้เป็นที่ตั้งของหน่วยธุรกรรมเชิงวิชาชีพ ให้บริการตรวจวิเคราะห์ผลิตภัณฑ์สุขภาพ แหล่งจำหน่ายผลิตภัณฑ์ที่พัฒนาขึ้นใหม่ และเป็นหน่วยสนับสนุนงานวิจัย การให้บริการทางวิชาการ และการพัฒนานวัตกรรมด้านเภสัชศาสตร์และสุขภาพ"
        }
      ]
    },
    {
      "id": "22-map02_p360_snc002",
      "name": "MAP02_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -1.4879906315599634,
        "pitch": -0.04171593765856585,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.6596019604495513,
          "pitch": 0.008859502946201303,
          "rotation": 0,
          "target": "1-map01_p360_snc002"
        },
        {
          "yaw": -1.4010981623752414,
          "pitch": 0.026486591432867357,
          "rotation": 0,
          "target": "17-map03_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.972435325448446,
          "pitch": -0.007103420659507975,
          "title": "สนามฟุตบอล",
          "text": "ตั้งอยู่บริเวณด้านหน้าทางเข้าหลักของมหาวิทยาลัย ใช้สำหรับการออกกำลังกาย รวมถึงการแข่งขันกีฬาและกิจกรรมของนักศึกษา&nbsp;"
        }
      ]
    },
    {
      "id": "23-map26_p360_snc002",
      "name": "MAP26_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -0.9076866666450272,
        "pitch": 0.13157168172036116,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.0688518456455744,
          "pitch": -0.009705926932358722,
          "rotation": 0,
          "target": "17-map03_p360_snc002"
        },
        {
          "yaw": -0.9603798131092525,
          "pitch": -0.013908236827592901,
          "rotation": 0,
          "target": "24-map49_p360_snc002"
        },
        {
          "yaw": -2.017027520583575,
          "pitch": 0.004238371650595596,
          "rotation": 0,
          "target": "26-map51_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.7629610111138394,
          "pitch": -1.1042179180882918,
          "title": "โรงผลิตน้ำ",
          "text": "เป็นส่วนหนึ่งของระบบสาธารณูปโภคพื้นฐานของมหาวิทยาลัยศิลปากร วิทยาเขตพระราชวังสนามจันทร์ ประกอบด้วยหอถังเก็บน้ำสูงที่ใช้สำหรับกักเก็บและจ่ายน้ำให้กับอาคารเรียน หอพัก และหน่วยงานต่าง ๆ ภายในมหาวิทยาลัย"
        },
        {
          "yaw": 0.24648149298804256,
          "pitch": -0.1514249758088262,
          "title": "ศูนย์รักษาความปลอดภัย",
          "text": "ศูนย์ควบคุมและประสานงานด้านความปลอดภัยของมหาวิทยาลัยศิลปากร วิทยาเขตพระราชวังสนามจันทร์ ตั้งอยู่ตรงข้ามโรงผลิตน้ำ ทำหน้าที่ดูแลความปลอดภัยและความเรียบร้อยภายในมหาวิทยาลัย"
        }
      ]
    },
    {
      "id": "24-map49_p360_snc002",
      "name": "MAP49_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.5448454079814358,
          "pitch": 0.003034994832269433,
          "rotation": 0,
          "target": "23-map26_p360_snc002"
        },
        {
          "yaw": 0.9762470265576937,
          "pitch": 0.03861933384179039,
          "rotation": 0,
          "target": "25-map50_p360_snc002"
        },
        {
          "yaw": -2.4238310340897122,
          "pitch": 0.0006361727571775333,
          "rotation": 0,
          "target": "13-map47_p360_snc002"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "25-map50_p360_snc002",
      "name": "MAP50_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.683111585112047,
          "pitch": 0.017874917602457074,
          "rotation": 0,
          "target": "26-map51_p360_snc002"
        },
        {
          "yaw": 0.049610817269639895,
          "pitch": 0.043512353565642314,
          "rotation": 0,
          "target": "24-map49_p360_snc002"
        },
        {
          "yaw": -2.595644520247415,
          "pitch": 0.028491200126875782,
          "rotation": 0,
          "target": "9-map30_p360_snc002"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "26-map51_p360_snc002",
      "name": "MAP51_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.3090288255447877,
          "pitch": 0.008872234940309198,
          "rotation": 0,
          "target": "23-map26_p360_snc002"
        },
        {
          "yaw": -2.9759095900091204,
          "pitch": 0.014046925374852748,
          "rotation": 0,
          "target": "33-map52_p360_snc002"
        },
        {
          "yaw": -0.9200054059253873,
          "pitch": 0.0020860391669135225,
          "rotation": 0,
          "target": "12-map54_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.030958588000331,
          "pitch": -0.3553219665594334,
          "title": "โรงละครวัชรนาฏยสภา (A4)",
          "text": "โรงละครแห่งแรกของคณะอักษรศาสตร์สำหรับสาขาวิชาการละครและจัดกิจกรรมที่เกี่ยวข้องกับการแสดง อาคารแห่งนี้มีสถาปัตยกรรมที่เรียบง่ายแต่สง่างามด้วยรูปทรงแปดเหลี่ยม สะท้อนบรรยากาศของพื้นที่การเรียนรู้ด้านศิลปวัฒนธรรมของมหาวิทยาลัย"
        },
        {
          "yaw": 1.3372824112630468,
          "pitch": -0.46711827026688724,
          "title": "สำนักอธิการบดี&nbsp;",
          "text": "ประกอบด้วยหน่วยงานหลักที่ทำหน้าที่บริหารจัดการวิทยาเขต ได้แก่ กองงานวิทยาเขตพระราชวังสนามจันทร์ กองกิจการนักศึกษา กองบริหารงานวิชาการ และกองบริการอาคาร สถานที่และยานพาหนะ เพื่อสนับสนุนการเรียนการสอนและอำนวยความสะดวกในวิทยาเขต"
        }
      ]
    },
    {
      "id": "27-map09_p360_snc002",
      "name": "MAP09_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.7616259972637165,
          "pitch": 0.11914598262522702,
          "rotation": 0,
          "target": "28-map08_p360_snc002"
        },
        {
          "yaw": -2.7863495214503704,
          "pitch": 0.02976302478427506,
          "rotation": 0,
          "target": "29-map10_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.014638662517183,
          "pitch": 0.03186726679238028,
          "title": "ลานทรงพล",
          "text": "พื้นที่จัดกิจกรรมสำหรับอาจารย์ เจ้าหน้าที่ นักศึกษา ศิษย์เก่าของคณะอักษรศาสตร์และเป็นที่พักผ่อนหย่อนใจ"
        }
      ]
    },
    {
      "id": "28-map08_p360_snc002",
      "name": "MAP08_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.10350993021217647,
          "pitch": 0.0423737630439085,
          "rotation": 0,
          "target": "27-map09_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.5078443353513657,
          "pitch": -0.1507269698638094,
          "title": "อาคารวชิรมงกุฎ",
          "text": "พื้นที่เดิมเป็นที่ตั้งของโรงละครทรงพล ต่อมามีการรื้อถอนและก่อสร้างอาคารใหม่สูง 7 ชั้น พร้อมชั้นจอดรถใต้ดิน โดยออกแบบให้ภายในอาคารมีพื้นที่สำหรับ ‘โรงละครทรงพล’ ของสาขาวิชาการละคร คณะอักษรศาสตร์เพื่อเพิ่มศักยภาพการใช้พื้นที่และรองรับการจัดกิจกรรมทางวิชาการและศิลปวัฒนธรรมได้อย่างเหมาะสม"
        }
      ]
    },
    {
      "id": "29-map10_p360_snc002",
      "name": "MAP10_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.9989678183059851,
          "pitch": 0.006752337415008469,
          "rotation": 0,
          "target": "27-map09_p360_snc002"
        },
        {
          "yaw": 2.3005294798317824,
          "pitch": 0.006085976940562787,
          "rotation": 0,
          "target": "17-map03_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.3497971221763052,
          "pitch": -0.22410883510285728,
          "title": "ศาลปู่ไชยมงคลเทพหัสดิน (ศาลขาว)",
          "text": "ศาลแห่งแรกของมหาวิทยาลัย อยู่หน้าตึกคณะอักษรศาสตร์"
        },
        {
          "yaw": -0.5653727634844117,
          "pitch": -0.3341100884001378,
          "title": "ตึกอักษรศาสตร์&nbsp;",
          "text": "เป็นที่ตั้งของสำนักงานคณะอักษรศาสตร์ ซึ่งทำหน้าที่บริหารจัดการด้านวิชาการ การเรียนการสอน และการดำเนินงานของคณะ นอกจากนี้ยังเป็นพื้นที่สำหรับการติดต่อประสานงานของคณาจารย์ นักศึกษา และบุคลากรของคณะอักษรศาสตร์"
        }
      ]
    },
    {
      "id": "30-map22_p360_snc002",
      "name": "MAP22_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.315495177798333,
          "pitch": -0.006900830695936833,
          "rotation": 0,
          "target": "31-map07_p360_snc002"
        },
        {
          "yaw": 3.053325415168004,
          "pitch": 0.0019152046113575238,
          "rotation": 0,
          "target": "17-map03_p360_snc002"
        },
        {
          "yaw": -0.14057291574141928,
          "pitch": 0.02712789913148228,
          "rotation": 0,
          "target": "40-map37_p360_snc002"
        },
        {
          "yaw": 0.9192071584684509,
          "pitch": 0.03746380707944574,
          "rotation": 0,
          "target": "36-map20_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.7408602714734318,
          "pitch": 0.0027749853089495957,
          "title": "โรงอาหารสระแก้ว",
          "text": "โรงอาหารหลักของมหาวิทยาลัยศิลปากร วิทยาเขตพระราชวังสนามจันทร์ ตั้งอยู่ใกล้สระแก้ว บ่อน้ำขนาดใหญ่ใจกลางมหาวิทยาลัย"
        }
      ]
    },
    {
      "id": "31-map07_p360_snc002",
      "name": "MAP07_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.0727282990627316,
          "pitch": 0.010506311479208108,
          "rotation": 0,
          "target": "30-map22_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.8880131361625612,
          "pitch": -0.04338144446955816,
          "title": "สะพานสระแก้ว",
          "text": "สะพานไม้สำหรับคนเดินข้าม สระแก้ว บ่อน้ำขนาดใหญ่ที่ตั้งอยู่ใจกลางมหาวิทยาลัยศิลปากร วิทยาเขตพระราชวังสนามจันทร์ สะพานแห่งนี้ถือเป็นหนึ่งในพื้นที่แห่งความทรงจำของชาวศิลปากร และบริเวณสระแก้วยังเป็นที่อยู่อาศัยของ ตัวเงินตัวทอง ซึ่งชาวศิลปากรมักเรียกกันอย่างคุ้นเคยว่า “ตุ๊ดตู่”"
        },
        {
          "yaw": -0.28841347358917346,
          "pitch": -0.4496891543080359,
          "title": "ศาลาสระแก้ว",
          "text": "ศาลาทรงแปดเหลี่ยมที่มีลักษณะเป็นศาลาสวนแบบดั้งเดิมของพื้นที่พระราชวัง ตั้งอยู่บริเวณริมสระแก้ว&nbsp; ปัจจุบันศาลาแห่งนี้เป็นหนึ่งในแลนด์มาร์กสำคัญของมหาวิทยาลัยศิลปากร และใช้เป็นพื้นที่สำหรับกิจกรรมและการพักผ่อนของนักศึกษา"
        }
      ]
    },
    {
      "id": "32-map53_p360_snc002",
      "name": "MAP53_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.4408113325249374,
          "pitch": 0.06300490428670713,
          "rotation": 0,
          "target": "33-map52_p360_snc002"
        },
        {
          "yaw": 1.6423689771576093,
          "pitch": -0.03525676777321962,
          "rotation": 0,
          "target": "36-map20_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.647141349638237,
          "pitch": 0.1281222602302705,
          "title": "สะพานสระแก้ว",
          "text": "สะพานไม้สำหรับคนเดินข้าม สระแก้ว บ่อน้ำขนาดใหญ่ที่ตั้งอยู่ใจกลางมหาวิทยาลัยศิลปากร วิทยาเขตพระราชวังสนามจันทร์ สะพานแห่งนี้ถือเป็นหนึ่งในพื้นที่แห่งความทรงจำของชาวศิลปากร และบริเวณสระแก้วยังเป็นที่อยู่อาศัยของ ตัวเงินตัวทอง ซึ่งชาวศิลปากรมักเรียกกันอย่างคุ้นเคยว่า “ตุ๊ดตู่”"
        }
      ]
    },
    {
      "id": "33-map52_p360_snc002",
      "name": "MAP52_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.4094114043231905,
          "pitch": 0.027437849711350992,
          "rotation": 0,
          "target": "32-map53_p360_snc002"
        },
        {
          "yaw": 0.7798642231856832,
          "pitch": 0.0460655698380954,
          "rotation": 0,
          "target": "26-map51_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.8774362685474575,
          "pitch": -0.058398366917957745,
          "title": "อนุสาวรีย์ อาจารย์ศิลป์ พีระศรี",
          "text": "ผู้ก่อตั้งมหาวิทยาลัยศิลปากรโปรดเพลง Santa Lucia เป็นอย่างยิ่ง จึงกำหนดให้เพลงดังกล่าวเป็นเพลงประจำมหาวิทยาลัย ทั้งนี้ วันที่ 15 กันยายนของทุกปีถือเป็นวันศิลป์ พีระศรี เพื่อรำลึกถึงผู้ก่อตั้งมหาวิทยาลัยศิลปากรและคุณูปการที่มีต่อวงการศิลปะของประเทศไทย"
        }
      ]
    },
    {
      "id": "34-map27_p360_snc002",
      "name": "MAP27_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 1.5748323805307578,
        "pitch": -0.005554234259228963,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": -1.6393648287784313,
          "pitch": 0.0016477050334042787,
          "rotation": 0,
          "target": "35-map36_p360_snc002"
        },
        {
          "yaw": 1.54074201427441,
          "pitch": -0.0003564191374234582,
          "rotation": 0,
          "target": "49-map23_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.2554240997753059,
          "pitch": -0.01645843226470234,
          "title": "คณะวิทยาศาสตร์ อาคาร 55 ปี",
          "text": "อาคารเรียนหลังใหม่ของคณะวิทยาศาสตร์ ใช้เป็นห้องเรียน ห้องสัมมนา ห้องประชุมวิชาการ ห้องฝึกอบรมสำหรับงานบริการวิชาการและงานค่ายต่าง ๆ&nbsp;"
        },
        {
          "yaw": 2.5297246054517313,
          "pitch": -0.009037650912526729,
          "title": "เรือนพระสุรภี",
          "text": "อาคารไม้แบบเรือนไทยประยุกต์ที่สะท้อนลักษณะสถาปัตยกรรมของที่พักข้าราชบริพารในเขตพระราชวัง เมื่อพื้นที่พระราชวังสนามจันทร์ถูกใช้เป็นที่ตั้งของมหาวิทยาลัย เรือนจึงถูกปรับใช้ตามความเหมาะสม โดยเคยถูกใช้เป็นร้านซ่อมจักรยานของนักศึกษาและบุคลากร ทำให้มักเรียกกันอย่างไม่เป็นทางการว่า “บ้านจักรยาน” ปัจจุบันเรือนพระสุรภียังคงเป็นหนึ่งในอาคารประวัติศาสตร์ที่สะท้อนความเป็นมาของพื้นที่พระราชวังสนามจันทร์ และความต่อเนื่องของการใช้พื้นที่จากเขตพระราชฐานในอดีตสู่การเป็นพื้นที่การศึกษาในปัจจุบัน"
        }
      ]
    },
    {
      "id": "35-map36_p360_snc002",
      "name": "MAP36_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.3901111539407047,
          "pitch": 0.0005244213746777859,
          "rotation": 0,
          "target": "36-map20_p360_snc002"
        },
        {
          "yaw": 1.4754720036950628,
          "pitch": 0.009210067205428274,
          "rotation": 0,
          "target": "34-map27_p360_snc002"
        },
        {
          "yaw": 2.9248910339425365,
          "pitch": 0.0442966563785685,
          "rotation": 0,
          "target": "11-map28_p360_snc002"
        },
        {
          "yaw": 0.55712509382764,
          "pitch": 0.006516974707398759,
          "rotation": 0,
          "target": "37-map35_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.7843657839063027,
          "pitch": -0.10748603569407855,
          "title": "ลานทดลองอบแห้งพลังงานแสงอาทิตย์&nbsp;",
          "text": "พื้นที่ทดลองของภาควิชาฟิสิกส์ คณะวิทยาศาสตร์ สำหรับการใช้เครื่องอบแห้งพลังงานแสงอาทิตย์แบบอุโมงค์ลมร้อน เพื่ออบแห้งผลิตผลทางการเกษตร โดยเป็นความร่วมมือระหว่างมหาวิทยาลัยศิลปากรและสถาบันจากประเทศเยอรมนี"
        },
        {
          "yaw": 1.1551179959995732,
          "pitch": -0.3349596180604735,
          "title": "อาคารเรือนกระจก คณะวิทยาศาสตร์",
          "text": "พื้นที่ปฏิบัติการสำหรับการทดลองและศึกษาวิจัยด้านพืชและสิ่งแวดล้อม โดยสามารถควบคุมสภาพแวดล้อม เช่น แสง อุณหภูมิ และความชื้น เพื่อใช้ในการเรียนการสอนและงานวิจัยของนักศึกษาคณะวิทยาศาสตร์"
        }
      ]
    },
    {
      "id": "36-map20_p360_snc002",
      "name": "MAP20_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.676160012655922,
          "pitch": -0.03054734757414046,
          "rotation": 0,
          "target": "40-map37_p360_snc002"
        },
        {
          "yaw": -0.42660900969919524,
          "pitch": 0.006659332521408601,
          "rotation": 0,
          "target": "35-map36_p360_snc002"
        },
        {
          "yaw": 2.4614555764663333,
          "pitch": 0.003785490544725434,
          "rotation": 0,
          "target": "30-map22_p360_snc002"
        },
        {
          "yaw": 2.1755039546625508,
          "pitch": 0.012014725625013156,
          "rotation": 0,
          "target": "32-map53_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 3.122308662109841,
          "pitch": -0.05051636578231822,
          "title": "อาคารนิทรรศการธรรมชาติวิทยา",
          "text": "เป็นแหล่งรวบรวมตัวอย่างทรัพยากรธรรมชาติและเป็นแหล่งเรียนรู้ทางด้านวิทยาศาสตร์และสิ่งแวดล้อม"
        },
        {
          "yaw": -1.6757769868577128,
          "pitch": -0.2241441332831524,
          "title": "คณะวิทยาศาสตร์ อาคารวิทยาศาสตร์ 1",
          "text": "อาคารหลักที่เป็นศูนย์กลางการบริหารงานของคณะ ประกอบด้วยสำนักงานคณบดี ภาควิชาจุลชีววิทยา ภาควิชาชีววิทยา ภาควิชาวิทยาการคอมพิวเตอร์ ภาควิชาคณิตศาสตร์และภาควิชาสถิติ"
        }
      ]
    },
    {
      "id": "37-map35_p360_snc002",
      "name": "MAP35_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -2.8862398453497633,
        "pitch": 0.08176695603110318,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.4367013846032144,
          "pitch": 0.012294513218733982,
          "rotation": 0,
          "target": "38-map34_p360_snc002"
        },
        {
          "yaw": -2.680891916788932,
          "pitch": 0.010889845476411253,
          "rotation": 0,
          "target": "35-map36_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.168867307056022,
          "pitch": -0.0271283245967755,
          "title": "คณะวิทยาศาสตร์ อาคารวิทยาศาสตร์ 3",
          "text": "ประกอบด้วยห้องบรรยาย ห้องสัมมนา ภาควิชาเคมีและภาควิชาฟิสิกส์&nbsp;"
        }
      ]
    },
    {
      "id": "38-map34_p360_snc002",
      "name": "MAP34_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.6132808521459898,
          "pitch": -0.003883292249975412,
          "rotation": 0,
          "target": "39-map33_p360_snc002"
        },
        {
          "yaw": -0.9662291434134573,
          "pitch": 0.011728021513150111,
          "rotation": 0,
          "target": "37-map35_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.786130898932523,
          "pitch": -0.2643169054574557,
          "title": "คณะวิทยาศาสตร์ อาคารวิทยาศาสตร์ 4",
          "text": "ประกอบด้วยภาควิชาวิทยาศาสตร์สิ่งแวดล้อม ห้องปฎิบัติการรวมและเครื่องมือวิทยาศาสตร์"
        },
        {
          "yaw": 0.6542597677692807,
          "pitch": -0.04753593954835722,
          "title": "คณะวิทยาศาสตร์ อาคารเรียนรวม",
          "text": "พื้นที่สำคัญสำหรับการเรียนรู้ร่วมกันของนักศึกษาคณะวิทยาศาสตร์ ภายในอาคารประกอบด้วยห้องบรรยายและห้องเรียนขนาดต่าง ๆ ที่รองรับการเรียนการสอนของนักศึกษาจำนวนมาก รวมถึงการจัดกิจกรรมทางวิชาการ การสัมมนา และโครงการพัฒนาศักยภาพด้านวิทยาศาสตร์ของนักศึกษาและเยาวชน"
        }
      ]
    },
    {
      "id": "39-map33_p360_snc002",
      "name": "MAP33_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 2.6831481091481066,
        "pitch": 0.048277349636789424,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.10459769204485525,
          "pitch": 0.003578275070259096,
          "rotation": 0,
          "target": "40-map37_p360_snc002"
        },
        {
          "yaw": -1.7186627252922513,
          "pitch": 0.011446009946931568,
          "rotation": 0,
          "target": "38-map34_p360_snc002"
        },
        {
          "yaw": 2.0747756639265518,
          "pitch": 0.009793933331810223,
          "rotation": 0,
          "target": "43-map40_p360_snc002"
        },
        {
          "yaw": 2.9361166642346657,
          "pitch": 0.007514720697589183,
          "rotation": 0,
          "target": "44-map15_p360_snc002"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "40-map37_p360_snc002",
      "name": "MAP37_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 3.006823635404186,
        "pitch": -0.07175505608606336,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.01085439069533578,
          "pitch": -0.016279827487336362,
          "rotation": 0,
          "target": "30-map22_p360_snc002"
        },
        {
          "yaw": -3.0996393363236336,
          "pitch": 0.016699001398638558,
          "rotation": 0,
          "target": "39-map33_p360_snc002"
        },
        {
          "yaw": -1.8434359397577094,
          "pitch": 0.028810412380121164,
          "rotation": 0,
          "target": "36-map20_p360_snc002"
        },
        {
          "yaw": 1.822400243292643,
          "pitch": -0.002285987554673241,
          "rotation": 0,
          "target": "42-map39_p360_snc002"
        },
        {
          "yaw": 2.4792637928698262,
          "pitch": 0.016954851921889613,
          "rotation": 0,
          "target": "41-map38_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.147049000347657,
          "pitch": -0.01383633816167773,
          "title": "อาคารศูนย์เรียนรวม 2&nbsp;",
          "text": "อาคารเรียนส่วนกลางของมหาวิทยาลัยศิลปากร"
        },
        {
          "yaw": -2.3442365780180037,
          "pitch": -0.15878402236912414,
          "title": "คณะวิทยาศาสตร์ อาคารวิทยาศาสตร์ 2",
          "text": "ประกอบด้วยหอประชุม พิพิธภัณฑ์ และห้องเรียนขนาดเล็ก"
        }
      ]
    },
    {
      "id": "41-map38_p360_snc002",
      "name": "MAP38_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.557144707945513,
          "pitch": -0.006120615737398083,
          "rotation": 0,
          "target": "43-map40_p360_snc002"
        },
        {
          "yaw": -2.1910875595428223,
          "pitch": 0.020941224261912694,
          "rotation": 0,
          "target": "40-map37_p360_snc002"
        },
        {
          "yaw": -1.3693916132371342,
          "pitch": 0.014275615989710388,
          "rotation": 0,
          "target": "42-map39_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.156264069100839,
          "pitch": 0.0013253017616783325,
          "title": "สำนักดิจิทัลเทคโนโลยี",
          "text": "หน่วยงานกลางที่พัฒนาและให้บริการระบบเทคโนโลยีสารสนเทศและโครงสร้างพื้นฐานดิจิทัลของมหาวิทยาลัย สนับสนุนการเรียนการสอน การวิจัย และการบริหารจัดการของมหาวิทยาลัยศิลปากรในยุคดิจิทัล"
        },
        {
          "yaw": 1.0776718341374085,
          "pitch": -0.042388467381533346,
          "title": "สำนักหอสมุดกลาง หอสมุดพระราชวังสนามจันทร์",
          "text": "ศูนย์กลางทรัพยากรสารสนเทศและการเรียนรู้ของมหาวิทยาลัยศิลปากร ประกอบด้วยอาคารหอสมุดหลักและอาคารหม่อมหลวงปิ่น มาลากุล ให้บริการหนังสือ ฐานข้อมูลดิจิทัล และพื้นที่การเรียนรู้ที่สนับสนุนการศึกษา การวิจัย และการสร้างองค์ความรู้ของนักศึกษาและบุคลากรของมหาวิทยาลัย"
        }
      ]
    },
    {
      "id": "42-map39_p360_snc002",
      "name": "MAP39_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.46865710571977814,
          "pitch": 0.01143539121365933,
          "rotation": 0,
          "target": "40-map37_p360_snc002"
        },
        {
          "yaw": 2.8636559381900373,
          "pitch": 0.017261019589597026,
          "rotation": 0,
          "target": "21-map14_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.3378882532411875,
          "pitch": 0.013237615273766323,
          "title": "อาคารเทคโนโลยีเภสัชกรรม คณะเภสัชศาสตร์",
          "text": "อาคารที่ตั้งของสำนักงานคณบดีและห้องปฏิบัติการด้านเภสัชกรรมของคณะเภสัชศาสตร์"
        },
        {
          "yaw": -2.251198893037394,
          "pitch": -0.06782791171741565,
          "title": "อาคารหม่อมหลวงปิ่น มาลากุล&nbsp;",
          "text": "อาคารส่วนต่อขยายของหอสมุดมหาวิทยาลัยศิลปากร ที่พัฒนาขึ้นเพื่อรองรับรูปแบบการเรียนรู้สมัยใหม่ เป็นพื้นที่สำหรับการค้นคว้า การอ่าน การทำงานร่วมกัน และการเรียนรู้แบบบูรณาการของนักศึกษา ภายใต้สภาพแวดล้อมที่เอื้อต่อการสร้างสรรค์องค์ความรู้และการเรียนรู้ตลอดชีวิต"
        }
      ]
    },
    {
      "id": "43-map40_p360_snc002",
      "name": "MAP40_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.768318326942852,
          "pitch": 0.004054308833584486,
          "rotation": 0,
          "target": "39-map33_p360_snc002"
        },
        {
          "yaw": -1.8882733369890339,
          "pitch": -0.0075915482869213236,
          "rotation": 0,
          "target": "41-map38_p360_snc002"
        },
        {
          "yaw": 1.4246076044624711,
          "pitch": 0.014250316355141734,
          "rotation": 0,
          "target": "44-map15_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.486176728911646,
          "pitch": -0.03935479150622001,
          "title": "สำนักหอสมุดกลาง หอสมุดพระราชวังสนามจันทร์",
          "text": "ศูนย์กลางทรัพยากรสารสนเทศและการเรียนรู้ของมหาวิทยาลัยศิลปากร ประกอบด้วยอาคารหอสมุดหลักและอาคารหม่อมหลวงปิ่น มาลากุล ให้บริการหนังสือ ฐานข้อมูลดิจิทัล และพื้นที่การเรียนรู้ที่สนับสนุนการศึกษา การวิจัย และการสร้างองค์ความรู้ของนักศึกษาและบุคลากรของมหาวิทยาลัย"
        },
        {
          "yaw": -0.31867470884648874,
          "pitch": -0.13685154220630302,
          "title": "สำนักงานบริหารการวิจัย นวัตกรรมและการสร้างสรรค์ (สวนส.)",
          "text": "หน่วยงานภายใต้สำนักงานอธิการบดี มหาวิทยาลัยศิลปากร ทำหน้าที่สนับสนุนและบริหารจัดการงานวิจัยของมหาวิทยาลัย ตั้งแต่การพัฒนานักวิจัย การบริหารทุนวิจัย และการเผยแพร่ผลงานวิจัย โดยมุ่งส่งเสริมงานวิจัยที่มีคุณภาพและสามารถนำไปใช้ประโยชน์ต่อสังคมและประเทศ"
        }
      ]
    },
    {
      "id": "44-map15_p360_snc002",
      "name": "MAP15_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 3.132542861866895,
        "pitch": 0.07476078958547916,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.1038088712547776,
          "pitch": 0.06856794675403322,
          "rotation": 0,
          "target": "43-map40_p360_snc002"
        },
        {
          "yaw": -0.22815173236356046,
          "pitch": -0.005189893179711191,
          "rotation": 0,
          "target": "39-map33_p360_snc002"
        },
        {
          "yaw": 1.5048285733472628,
          "pitch": 0.000053257889376823186,
          "rotation": 0,
          "target": "45-map41_p360_snc002"
        },
        {
          "yaw": -3.1213137161269504,
          "pitch": -0.000026955710506371133,
          "rotation": 0,
          "target": "50-map21_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.774576334981055,
          "pitch": -0.0017968564914898622,
          "title": "โรงอาหารเพชรรัตน์&nbsp;",
          "text": "โรงอาหารของมหาวิทยาลัยศิลปากร ตั้งอยู่ตรงข้ามหอพักเพชรรัตน์และใกล้หอพักทับแก้ว 3 เพื่ออำนวยความสะดวกด้านอาหารและพื้นที่พักผ่อนแก่นักศึกษาในบริเวณหอพัก"
        }
      ]
    },
    {
      "id": "45-map41_p360_snc002",
      "name": "MAP41_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.8440926333179544,
          "pitch": 0.0015814702735656994,
          "rotation": 0,
          "target": "44-map15_p360_snc002"
        },
        {
          "yaw": -0.2939872023935717,
          "pitch": -0.0051311860345713,
          "rotation": 0,
          "target": "46-map43_p360_snc002"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "46-map43_p360_snc002",
      "name": "MAP43_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.293012170857269,
          "pitch": 0.031354398955235396,
          "rotation": 0,
          "target": "45-map41_p360_snc002"
        },
        {
          "yaw": -2.064295965058381,
          "pitch": 0.02772610728381153,
          "rotation": 0,
          "target": "47-map42_p360_snc002"
        },
        {
          "yaw": 0.9125184276658711,
          "pitch": 0.015105407495010326,
          "rotation": 0,
          "target": "52-map44_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 3.0182515302287998,
          "pitch": -0.0616812210670048,
          "title": "ศูนย์เรียนรวมเฉลิมพระเกียรติ (15ชั้น)&nbsp;",
          "text": "อาคารเรียนรวมของมหาวิทยาลัยศิลปากร ใช้สำหรับการเรียนการสอนรายวิชาศึกษาทั่วไป และเป็นที่ตั้งของศูนย์บริหารจัดการวิชาศึกษาทั่วไป ศูนย์พัฒนาการเรียนรู้ภาษาอังกฤษ และศูนย์นวัตกรรมการศึกษา"
        }
      ]
    },
    {
      "id": "47-map42_p360_snc002",
      "name": "MAP42_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.6373786171431455,
          "pitch": 0.012587530839775596,
          "rotation": 0,
          "target": "46-map43_p360_snc002"
        },
        {
          "yaw": -0.9156117597945013,
          "pitch": -0.017251620551647306,
          "rotation": 0,
          "target": "48-map65_p360_snc002"
        },
        {
          "yaw": -2.4641891095755,
          "pitch": 0.018384534738647318,
          "rotation": 0,
          "target": "21-map14_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.078586587241748,
          "pitch": 0.025946781681170705,
          "title": "บ่อบำบัดน้ำเสีย",
          "text": "พื้นที่สำหรับบำบัดน้ำเสียของมหาวิทยาลัยศิลปากร ก่อนปล่อยกลับสู่ธรรมชาติ เพื่อสนับสนุนการจัดการสิ่งแวดล้อมอย่างยั่งยืนภายในวิทยาเขต"
        },
        {
          "yaw": 2.495217424276495,
          "pitch": -0.025146286136626728,
          "title": "อาคารหม่อมหลวงปิ่น มาลากุล&nbsp;",
          "text": "อาคารส่วนต่อขยายของหอสมุดมหาวิทยาลัยศิลปากร ที่พัฒนาขึ้นเพื่อรองรับรูปแบบการเรียนรู้สมัยใหม่ เป็นพื้นที่สำหรับการค้นคว้า การอ่าน การทำงานร่วมกัน และการเรียนรู้แบบบูรณาการของนักศึกษา ภายใต้สภาพแวดล้อมที่เอื้อต่อการสร้างสรรค์องค์ความรู้และการเรียนรู้ตลอดชีวิต"
        },
        {
          "yaw": -0.53945856327468,
          "pitch": -0.02242911613130083,
          "title": "คณะวิศวกรรมศาสตร์และเทคโนโลยีอุตสาหกรรม",
          "text": "คณะวิชาลำดับที่ 9 ของมหาวิทยาลัยศิลปากร เดิมชื่อคณะเทคโนโลยีอุตสาหกรรม มุ่งพัฒนาวิศวกรและนวัตกรภายใต้แนวคิด Creative Engineering เพื่อขับเคลื่อนอุตสาหกรรมและเทคโนโลยีอย่างยั่งยืน"
        }
      ]
    },
    {
      "id": "48-map65_p360_snc002",
      "name": "MAP65_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.615417860082209,
          "pitch": 0.007050591714509835,
          "rotation": 0,
          "target": "47-map42_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.4808287602191808,
          "pitch": -0.4808473492798093,
          "title": "ประตูวิศวกรรมศาสตร์ (ประตูมาลัยแมน)",
          "text": "ประตูทางเข้าของมหาวิทยาลัยศิลปากรที่ตั้งอยู่ติดถนนมาลัยแมน ใกล้กับคณะวิศวกรรมศาสตร์และเทคโนโลยีอุตสาหกรรม เป็นจุดเชื่อมต่อสำคัญระหว่างมหาวิทยาลัยกับพื้นที่โดยรอบ (ปิดวันเสาร์- อาทิตย์และวันหยุดนักขตฤกษ์)&nbsp;"
        }
      ]
    },
    {
      "id": "49-map23_p360_snc002",
      "name": "MAP23_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.7252600845093156,
          "pitch": -0.005035573955069594,
          "rotation": 0,
          "target": "34-map27_p360_snc002"
        },
        {
          "yaw": -1.0575294969811857,
          "pitch": -0.023508853285724385,
          "rotation": 0,
          "target": "60-map24_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.7987013989375065,
          "pitch": 0.043762548292932024,
          "title": "เรือนพระกรรมสักขี&nbsp;",
          "text": "เรือนไม้ที่ตั้งอยู่ภายในเขตพระราชวังสนามจันทร์ เดิมเป็นที่ประทับของ พระนางเจ้าสุวัทนา พระวรราชเทวี พระมเหสีในพระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัว (รัชกาลที่ 6) ซึ่งทรงเป็นพระขนิษฐาของเจ้าพระยารามราฆพและเคยใช้เป็นสถานที่ฝึกซ้อม ละครหลวงฝ่ายใน ซึ่งสะท้อนบทบาทของพระราชวังสนามจันทร์ในฐานะศูนย์กลางกิจกรรมศิลปะการแสดงของราชสำนักในสมัยนั้น"
        }
      ]
    },
    {
      "id": "50-map21_p360_snc002",
      "name": "MAP21_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 1.111608639542279,
        "pitch": -0.04681646606669432,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -1.8570839814541564,
          "pitch": 0.005469519046908289,
          "rotation": 0,
          "target": "44-map15_p360_snc002"
        },
        {
          "yaw": -0.350706501301179,
          "pitch": -0.005125878674162365,
          "rotation": 0,
          "target": "51-map45_p360_snc002"
        },
        {
          "yaw": 1.1064581049275475,
          "pitch": -0.003152284227116553,
          "rotation": 0,
          "target": "60-map24_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.949056588750805,
          "pitch": 0.06197857455923739,
          "title": "หอพักเพชรรัตน์ 1-7 (หอหญิง)",
          "text": "พื้นที่ที่พักอาศัยของนักศึกษาหญิงภายในมหาวิทยาลัยศิลปากร ประกอบด้วยอาคารหอพักหลายหลังและพื้นที่ส่วนกลางสำหรับการใช้ชีวิตประจำวัน"
        },
        {
          "yaw": 0.6462605168214672,
          "pitch": -0.0621916091893393,
          "title": "หอพักทับแก้ว 3 (หอชาย)",
          "text": "ใช้เป็นที่พักอาศัยสำหรับนักศึกษาชายที่พักภายในมหาวิทยาลัย ภายในอาคารมีห้องพักและพื้นที่ส่วนกลางสำหรับการใช้ชีวิตประจำวันของนักศึกษา ตั้งอยู่ใกล้กับโรงอาหารเพชรรัตน์และพื้นที่บริการต่าง ๆ เพื่ออำนวยความสะดวกในการดำเนินชีวิต"
        }
      ]
    },
    {
      "id": "51-map45_p360_snc002",
      "name": "MAP45_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.14656197342331012,
          "pitch": 0.0075095243984080184,
          "rotation": 0,
          "target": "50-map21_p360_snc002"
        },
        {
          "yaw": 2.448366782234719,
          "pitch": 0.02140288012368785,
          "rotation": 0,
          "target": "52-map44_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.5698451901006036,
          "pitch": -0.12397708908368266,
          "title": "อาคารเพชรรัตน์-สุวัทนา (อาคารปฎิบัติการกีฬาใหม่)&nbsp;",
          "text": "เป็นอาคารปฏิบัติการด้านกีฬาและกิจกรรมนักศึกษาของมหาวิทยาลัยศิลปากร และเป็นที่ตั้งของ กองกิจการนักศึกษา ซึ่งดูแลกิจกรรมนันทนาการและการพัฒนานักศึกษา โดยภายในมีพื้นที่ออกกำลังกายและจัดกิจกรรมต่าง ๆ ของนักศึกษา"
        },
        {
          "yaw": -0.8401953064384475,
          "pitch": -0.05069774053016474,
          "title": "Sport Complex&nbsp;",
          "text": "พื้นที่สำหรับการออกกำลังกายและกิจกรรมกีฬาของนักศึกษาและบุคลากร นอกจากนี้บริเวณใกล้เคียงยังมี ตลาดนัดช่วงเย็น ที่จำหน่ายอาหารและของว่างหลากหลายประเภท ซึ่งเป็นพื้นที่ยอดนิยมสำหรับการพักผ่อนและพบปะสังสรรค์ของนักศึกษาหลังเลิกเรียนและการออกกำลังกาย"
        }
      ]
    },
    {
      "id": "52-map44_p360_snc002",
      "name": "MAP44_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.7811685614247565,
          "pitch": 0.022780540482330025,
          "rotation": 0,
          "target": "51-map45_p360_snc002"
        },
        {
          "yaw": 1.4956541701070858,
          "pitch": -0.0077935862049081095,
          "rotation": 0,
          "target": "53-map46_p360_snc002"
        },
        {
          "yaw": -0.05631138043409223,
          "pitch": -0.015851394943712904,
          "rotation": 0,
          "target": "46-map43_p360_snc002"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "53-map46_p360_snc002",
      "name": "MAP46_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.6452009580553941,
          "pitch": 0.06880771569372612,
          "rotation": 0,
          "target": "52-map44_p360_snc002"
        },
        {
          "yaw": -0.87900997281805,
          "pitch": 0.01098420960065205,
          "rotation": 0,
          "target": "54-map06_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.2990169680036576,
          "pitch": 0.014433416448369485,
          "title": "อาคารศิลป์ พีระศรี 2",
          "text": "ที่ตั้งของคณะจิตรกรรม ประติมากรรมและภาพพิมพ์ ดำเนินการสอนเพื่อผลิตบัณฑิตสาขาทัศนศิลป์แขนงต่าง ๆ โดยมุ่งเน้นการเผยแพร่ส่งเสริมงานศิลปวัฒนธรรมทั้งในและต่างประเทศ และเป็นที่ตั้งของหอศิลป์บรมราชกุมารี"
        }
      ]
    },
    {
      "id": "54-map06_p360_snc002",
      "name": "MAP06_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -3.094624143671169,
          "pitch": 0.0015595018415890394,
          "rotation": 0,
          "target": "53-map46_p360_snc002"
        },
        {
          "yaw": 0.048807883112393924,
          "pitch": 0.010841464628988717,
          "rotation": 0,
          "target": "55-map04_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.4960922548355668,
          "pitch": -0.11236497632491371,
          "title": "อาคารศิลป์ พีระศรี 3",
          "text": "คณะมัณนศิลป์ คณะทางศิลปะและการออกแบบที่มีเอกลักษณ์เฉพาะตัว และเป็นคณะเดียวในประเทศไทยที่ใช้ชื่อ “มัณฑนศิลป์” ซึ่งสะท้อนแนวคิดด้านการสร้างสรรค์งานศิลปะเพื่อการใช้สอยและการออกแบบเพื่อคุณค่าทางสุนทรียะและสังคม"
        }
      ]
    },
    {
      "id": "55-map04_p360_snc002",
      "name": "MAP04_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 3.1205017383537133,
          "pitch": 0.004646010401035738,
          "rotation": 0,
          "target": "54-map06_p360_snc002"
        },
        {
          "yaw": 1.2253416532870904,
          "pitch": 0.018114053100351413,
          "rotation": 0,
          "target": "56-map05_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.5922306923288723,
          "pitch": -0.044482677257050796,
          "title": "อาคารศิลป์พีระศรี 1&nbsp;",
          "text": "พื้นที่ใช้งานร่วมกันของคณะสถาปัตยกรรม หลักสูตรสุขภาพดิจิทัลของคณะเภสัชศาสตร์ หลักสูตรเทคโนโลยีสื่อสร้างสรรค์ของคณะเทคโนโลยีสารสนเทศและการสื่อสาร ภาควิชาประติมากรรมของคณะจิตรกรรม ประติมากรรมและภาพพิมพ์&nbsp;"
        }
      ]
    },
    {
      "id": "56-map05_p360_snc002",
      "name": "MAP05_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.2365424271964507,
          "pitch": -0.0014217765647153158,
          "rotation": 0,
          "target": "55-map04_p360_snc002"
        },
        {
          "yaw": 1.510370421031424,
          "pitch": -0.0026842894670373596,
          "rotation": 0,
          "target": "59-map17_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.8571768952471821,
          "pitch": 0.03474185446122391,
          "title": "โครงการบ้านประหยัดพลังงาน",
          "text": "ปัจจุบันเป็นที่ทำการชั่วคราวสหกรณ์ออมทรัพย์ มหาวิทยาลัยศิลปากร จำกัด"
        }
      ]
    },
    {
      "id": "57-map18_p360_snc002",
      "name": "MAP18_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.6714944407045422,
          "pitch": 0.010029349025787226,
          "rotation": 0,
          "target": "58-map19_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.7314248326598989,
          "pitch": -0.029590040390573336,
          "title": "กลุ่มอาคารปฎิบัติงานคณะมัณนศิลป์",
          "text": "พื้นที่สำหรับการฝึกปฏิบัติด้านศิลปะและการออกแบบของนักศึกษาคณะมัณฑนศิลป์ ภายในประกอบด้วยห้องปฏิบัติการและเวิร์กชอปสำหรับการสร้างสรรค์ผลงานด้านการออกแบบหลากหลายสาขา"
        }
      ]
    },
    {
      "id": "58-map19_p360_snc002",
      "name": "MAP19_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.4007282628848632,
          "pitch": -0.006197306008122183,
          "rotation": 0,
          "target": "57-map18_p360_snc002"
        },
        {
          "yaw": 2.9045339072738106,
          "pitch": -0.007701533068320998,
          "rotation": 0,
          "target": "59-map17_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.6256369436304308,
          "pitch": -0.005144203011147042,
          "title": "อาคารปฏิบัติงานหล่อ ภาควิชาประติมากรรม",
          "text": "พื้นที่สตูดิโอสำหรับการสร้างสรรค์ผลงาน ของคณะจิตรกรรม ประติมากรรมและภาพพิมพ์"
        },
        {
          "yaw": -3.053845257035439,
          "pitch": -0.017371333273938916,
          "title": "ภาควิชาเครื่องปั้นดินเผา คณะมัณฑนศิลป์",
          "text": "พื้นที่สำหรับการเรียนการสอนและสร้างสรรค์งานเซรามิกของนักศึกษา ภายในมีสตูดิโอปั้นดิน ห้องเคลือบ และเตาเผาเซรามิกขนาดใหญ่สำหรับการเผาผลงาน"
        }
      ]
    },
    {
      "id": "59-map17_p360_snc002",
      "name": "MAP17_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.4389271764722267,
          "pitch": -0.002456463391657948,
          "rotation": 0,
          "target": "61-map16_p360_snc002"
        },
        {
          "yaw": 2.886877228547931,
          "pitch": -0.009101002074233477,
          "rotation": 0,
          "target": "60-map24_p360_snc002"
        },
        {
          "yaw": 1.8775998252423056,
          "pitch": 0.011766246760707588,
          "rotation": 0,
          "target": "58-map19_p360_snc002"
        },
        {
          "yaw": -1.3515434353809201,
          "pitch": 0.008579951651064732,
          "rotation": 0,
          "target": "56-map05_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.9007456431405672,
          "pitch": -0.02095360188910611,
          "title": "โรงพิมพ์มหาวิทยาลัยศิลปากร",
          "text": "หน่วยงานที่ให้บริการด้านการพิมพ์หนังสือ ตำรา เอกสารทางวิชาการ และสื่อสิ่งพิมพ์ต่าง ๆ เพื่อสนับสนุนภารกิจด้านการศึกษาและการเผยแพร่องค์ความรู้ของมหาวิทยาลัย"
        },
        {
          "yaw": -1.9823767659145837,
          "pitch": -0.015733325083157723,
          "title": "ตลาดสวัสดิการนักศึกษา",
          "text": "ตลาดนัดช่วงเย็นที่จำหน่ายอาหารและของว่างหลากหลายประเภทในราคาย่อมเยา เป็นพื้นที่ยอดนิยมของนักศึกษาและบุคลากรในการรับประทานอาหารและพบปะสังสรรค์ ตั้งอยู่บริเวณใกล้กับ Sport Complex&nbsp;"
        }
      ]
    },
    {
      "id": "60-map24_p360_snc002",
      "name": "MAP24_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -3.0882915532478386,
        "pitch": 0.06579063178991085,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": -3.006186189237255,
          "pitch": 0.01271017800012686,
          "rotation": 0,
          "target": "59-map17_p360_snc002"
        },
        {
          "yaw": -1.571088149062108,
          "pitch": -0.010167491374563298,
          "rotation": 0,
          "target": "49-map23_p360_snc002"
        },
        {
          "yaw": -0.13507535278464644,
          "pitch": -0.00888014893065403,
          "rotation": 0,
          "target": "50-map21_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.501959159659716,
          "pitch": 0.00952472102087043,
          "title": "ตลาดสวัสดิการนักศึกษา",
          "text": "ตลาดนัดช่วงเย็นที่จำหน่ายอาหารและของว่างหลากหลายประเภทในราคาย่อมเยา เป็นพื้นที่ยอดนิยมของนักศึกษาและบุคลากรในการรับประทานอาหารและพบปะสังสรรค์ ตั้งอยู่บริเวณใกล้กับ Sport Complex&nbsp;"
        }
      ]
    },
    {
      "id": "61-map16_p360_snc002",
      "name": "MAP16_p360_snc002",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.1304244989086065,
          "pitch": 0.012079713901723466,
          "rotation": 0,
          "target": "59-map17_p360_snc002"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.3178368033632868,
          "pitch": -0.19998578178126714,
          "title": "ประตูเหนือวัง (ทางรถไฟ)",
          "text": "เป็นประตูทางเข้า–ออกด้านเหนือของมหาวิทยาลัยศิลปากร วิทยาเขตพระราชวังสนามจันทร์ เชื่อมต่อพื้นที่มหาวิทยาลัยกับเส้นทางคมนาคมด้านหลังและแนวทางรถไฟนครปฐม"
        }
      ]
    }
  ],
  "name": "Project Title",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": true,
    "fullscreenButton": false,
    "viewControlButtons": false
  }
};
