var APP_DATA = {
  "scenes": [
    {
      "id": "0-map34_p360_pb001",
      "name": "MAP34_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.3467561094998892,
          "pitch": -0.05699898505080725,
          "rotation": 0,
          "target": "1-map33_p360_pb001"
        },
        {
          "yaw": -0.01116940343424666,
          "pitch": 0.8593446922443064,
          "rotation": 0,
          "target": "19-map19_p360_pb001"
        },
        {
          "yaw": 3.025143923908706,
          "pitch": 0.3433297450867805,
          "rotation": 0,
          "target": "6-map05_p360_pb001"
        },
        {
          "yaw": -1.0473219991475098,
          "pitch": 0.17233064156306988,
          "rotation": 0,
          "target": "26-map25_p360_pb001"
        },
        {
          "yaw": 1.2838735236856031,
          "pitch": 0.222485442715616,
          "rotation": 0,
          "target": "17-map18_p360_pb001"
        },
        {
          "yaw": -0.5176621259371981,
          "pitch": 0.21634163121592742,
          "rotation": 0,
          "target": "24-map23_p360_pb001"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "1-map33_p360_pb001",
      "name": "MAP33_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.362412157632802,
          "pitch": -0.05402535792403995,
          "rotation": 0,
          "target": "0-map34_p360_pb001"
        },
        {
          "yaw": 0.33705394977070213,
          "pitch": 0.3153660136097862,
          "rotation": 0,
          "target": "2-map01_p360_pb001"
        },
        {
          "yaw": 1.1231064375573112,
          "pitch": 0.6009206951642199,
          "rotation": 0,
          "target": "10-map09_p360_pb001"
        },
        {
          "yaw": 0.26793537746778995,
          "pitch": 0.44791526896624134,
          "rotation": 0,
          "target": "3-map02_p360_pb001"
        },
        {
          "yaw": -1.307324038063694,
          "pitch": 0.23485773477447047,
          "rotation": 0,
          "target": "24-map23_p360_pb001"
        },
        {
          "yaw": 2.1635785422679454,
          "pitch": 0.8465989198233927,
          "rotation": 0,
          "target": "13-map12_p360_pb001"
        },
        {
          "yaw": 2.3942129342803096,
          "pitch": 0.3386065489859291,
          "rotation": 0,
          "target": "16-map15_p360_pb001"
        },
        {
          "yaw": -2.340481856860219,
          "pitch": 0.34702219391624567,
          "rotation": 0,
          "target": "19-map19_p360_pb001"
        },
        {
          "yaw": -0.6037856604424903,
          "pitch": 0.539228098499839,
          "rotation": 0,
          "target": "30-map29_p360_pb001"
        },
        {
          "yaw": -1.4441476120121983,
          "pitch": 0.3778281059689039,
          "rotation": 0,
          "target": "22-map22_p360_pb001"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "2-map01_p360_pb001",
      "name": "MAP01_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 1.502266432587704,
        "pitch": -0.07617960737682772,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": 1.5801233266609405,
          "pitch": -0.011022597616467067,
          "rotation": 0,
          "target": "3-map02_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.0187094094091016,
          "pitch": -0.13078073710890692,
          "title": "<b><span lang=\"TH\" style=\"font-size:16.0pt;font-family:\n&quot;TH Sarabun New&quot;,sans-serif;mso-fareast-font-family:Calibri;mso-fareast-theme-font:\nminor-latin;mso-ansi-language:EN-US;mso-fareast-language:EN-US;mso-bidi-language:\nTH\">วิทยาเขตสารสนเทศเพชรบุรี</span></b>",
          "text": "<p class=\"MsoNormal\" style=\"text-align:justify;text-justify:inter-cluster\">มหาวิทยาลัยศิลปากร วิทยาเขตสารสนเทศเพชรบุรี ตั้งอยู่ริมถนนเพชรเกษม บนเส้นทางบายพาสชะอำ–ปราณบุรี เป็นวิทยาเขตที่ผสมผสานการเรียนรู้ ชีวิตนักศึกษา ศิลปะ ความคิดสร้างสรรค์ และแนวคิดด้านความยั่งยืนไว้ภายในสภาพแวดล้อมที่กว้างขวางและใกล้ชิดธรรมชาติ</p>"
        }
      ]
    },
    {
      "id": "3-map02_p360_pb001",
      "name": "MAP02_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -1.5442551932206765,
        "pitch": -0.047554560517358624,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": 3.1198451392230258,
          "pitch": 0.06936332109539833,
          "rotation": 0,
          "target": "4-map03_p360_pb001"
        },
        {
          "yaw": -0.8571316526155481,
          "pitch": -0.018501149008319118,
          "rotation": 0,
          "target": "5-map04_p360_pb001"
        },
        {
          "yaw": 1.2212072488831964,
          "pitch": -0.004677487392719115,
          "rotation": 0,
          "target": "2-map01_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.5606999557120567,
          "pitch": -0.4199607862588657,
          "title": "เทวาลัยพระคเณศ",
          "text": "เทพแห่งความสำเร็จและเป็นสัญลักษณ์ของมหาวิทยาลัยศิลปากร ออกแบบโดยอาจารย์ประเวศ&nbsp; ลิมปะรังสี ศิลปินแห่งชาติสาขาสถาปัตยกรรมไทย ภายในประดิษฐานพระคเณศ ซึ่งออกแบบและปั้นหล่อโดยอาจารย์เสวต เทศน์ธรรม ประติมากรอาวุโส ศิษย์ท่านศาสตราจารย์ศิลป์ พีระศรี ด้านหน้าเทวาลัยมีอาคารนิทรรศการและจำหน่ายของที่ระลึก ภายในอาคารมีการจัดนิทรรศการการประวัติจัดสร้างพระคเณศประจำมหาวิทยาลัย รวมทั้งเช่าบูชาพระคเณศ"
        }
      ]
    },
    {
      "id": "4-map03_p360_pb001",
      "name": "MAP03_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 1.4026895404371693,
        "pitch": -0.09918544272014707,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": -1.9783207716438085,
          "pitch": 0.05156614693436268,
          "rotation": 0,
          "target": "3-map02_p360_pb001"
        },
        {
          "yaw": 1.119091681595183,
          "pitch": 0.04159044888675112,
          "rotation": 0,
          "target": "8-map07_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -3.0687331123853845,
          "pitch": -0.37583444332651794,
          "title": "เทวาลัยพระคเณศ",
          "text": "เทพแห่งความสำเร็จและเป็นสัญลักษณ์ของมหาวิทยาลัยศิลปากร ออกแบบโดยอาจารย์ประเวศ&nbsp; ลิมปะรังสี ศิลปินแห่งชาติสาขาสถาปัตยกรรมไทย ภายในประดิษฐานพระคเณศ ซึ่งออกแบบและปั้นหล่อโดยอาจารย์เสวต เทศน์ธรรม ประติมากรอาวุโส ศิษย์ท่านศาสตราจารย์ศิลป์ พีระศรี ด้านหน้าเทวาลัยมีอาคารนิทรรศการและจำหน่ายของที่ระลึก ภายในอาคารมีการจัดนิทรรศการการประวัติจัดสร้างพระคเณศประจำมหาวิทยาลัย รวมทั้งเช่าบูชาพระคเณศ"
        },
        {
          "yaw": 0.5043837251848924,
          "pitch": -0.021713436044271006,
          "title": "สวนประติมากรรม&nbsp;",
          "text": "ลานกลางแจ้ง แหล่งรวมผลงานประติมากรรมจากการประกวดศิลปกรรมแห่งชาติ กลายเป็นจุดเช็คอินและใช้จัดกิจกรรมทางด้านศิลปะและบันเทิงของมหาวิทยาลัย"
        }
      ]
    },
    {
      "id": "5-map04_p360_pb001",
      "name": "MAP04_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 2.821528231311289,
        "pitch": 0.1293163132502695,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": -2.660402564737085,
          "pitch": -0.015679026739373825,
          "rotation": 0,
          "target": "3-map02_p360_pb001"
        },
        {
          "yaw": -1.4147076563635448,
          "pitch": -0.007920907713883096,
          "rotation": 0,
          "target": "8-map07_p360_pb001"
        },
        {
          "yaw": 1.4762853530225746,
          "pitch": -0.006136908721078527,
          "rotation": 0,
          "target": "30-map29_p360_pb001"
        },
        {
          "yaw": -0.22531116036226173,
          "pitch": 0.01667038643144636,
          "rotation": 0,
          "target": "12-map11_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.1917536493422283,
          "pitch": -0.4063734256343441,
          "title": "เทวาลัยพระคเณศ",
          "text": "เทพแห่งความสำเร็จและเป็นสัญลักษณ์ของมหาวิทยาลัยศิลปากร ออกแบบโดยอาจารย์ประเวศ&nbsp; ลิมปะรังสี ศิลปินแห่งชาติสาขาสถาปัตยกรรมไทย ภายในประดิษฐานพระคเณศ ซึ่งออกแบบและปั้นหล่อโดยอาจารย์เสวต เทศน์ธรรม ประติมากรอาวุโส ศิษย์ท่านศาสตราจารย์ศิลป์ พีระศรี ด้านหน้าเทวาลัยมีอาคารนิทรรศการและจำหน่ายของที่ระลึก ภายในอาคารมีการจัดนิทรรศการการประวัติจัดสร้างพระคเณศประจำมหาวิทยาลัย รวมทั้งเช่าบูชาพระคเณศ"
        }
      ]
    },
    {
      "id": "6-map05_p360_pb001",
      "name": "MAP05_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.611320145960664,
          "pitch": -0.01408427100024845,
          "rotation": 0,
          "target": "19-map19_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 3.0122493909177965,
          "pitch": 0.019527697563027857,
          "title": "โรงผลิตปุ๋ยอินทรีย์ร่วมกับแก้วไบโอพลาสติค",
          "text": "<div>เป็นการผลิตปุ๋ยจากใบไม้และมูลวัว โดยมีส่วนผสมของแก้วไบโอพลาสติก (เป็นความร่วมมือกับบริษัท พีทีที&nbsp;</div><div>โกลบอล เคมิคัล จำกัด (มหาชน) ผลิตแก้วไบโอที่ย่อยสลายได้) ที่ใช้แล้วภายในวิทยาเขต โดยกรรมวิธีไม่พลิกกลับกอง องค์ความรู้จากมหาวิทยาลัยแม่โจ้&nbsp;</div><div><br></div>"
        },
        {
          "yaw": -1.3691106443579475,
          "pitch": -0.024371169349153732,
          "title": "โรงคัดแยกและกำจัดด้วยเตาเผาไร้ผลพิษ และบ่อบำบัดน้ำเสีย",
          "text": "มีการกำจัดขยะโดยเตาเผาปลอดมลพิษ สำหรับน้ำที่ใช้ในการอุปโภคมีการบำบัดตามแนวคิดโครงการพระราชดำริแหลมผักเบี้ย ประกอบด้วยรางระบายน้ำเสียจากอาคาร จำนวน 3 สาย โดยแต่ละสายจะไลลงสู่บ่อบำบัดน้ำเสียบ่อที่ 1 ทำหน้าที่เป็นบ่อตกตะกอน ,บ่อที่ 2 ทำหน้าที่เป็นบ่อผึ่ง และบ่อที่ 3 ทำหน้าที่ปรับสภาพน้ำ&nbsp;"
        }
      ]
    },
    {
      "id": "7-map06_p360_pb001",
      "name": "MAP06_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 2.174877323454746,
        "pitch": -0.03181858221345557,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": -1.4440780735056364,
          "pitch": -0.023332040572832113,
          "rotation": 0,
          "target": "10-map09_p360_pb001"
        },
        {
          "yaw": 1.4820627968184041,
          "pitch": 0.025609872300840664,
          "rotation": 0,
          "target": "11-map10_p360_pb001"
        },
        {
          "yaw": -3.1037517638809504,
          "pitch": -0.0018684944657128,
          "rotation": 0,
          "target": "12-map11_p360_pb001"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "8-map07_p360_pb001",
      "name": "MAP07_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -2.3589982613104237,
        "pitch": -0.043737867533923946,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": -0.24713430356567834,
          "pitch": -0.007081341940807562,
          "rotation": 0,
          "target": "5-map04_p360_pb001"
        },
        {
          "yaw": 0.9468097991962825,
          "pitch": 0.04259350553000729,
          "rotation": 0,
          "target": "4-map03_p360_pb001"
        },
        {
          "yaw": -2.9129850796809826,
          "pitch": 0.03256774143039287,
          "rotation": 0,
          "target": "9-map08_p360_pb001"
        },
        {
          "yaw": -1.6744196609068958,
          "pitch": 0.0231774907117277,
          "rotation": 0,
          "target": "10-map09_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.2062098689799079,
          "pitch": -0.2259290286245772,
          "title": "เทวาลัยพระคเณศ",
          "text": "เทพแห่งความสำเร็จและเป็นสัญลักษณ์ของมหาวิทยาลัยศิลปากร ออกแบบโดยอาจารย์ประเวศ&nbsp; ลิมปะรังสี ศิลปินแห่งชาติสาขาสถาปัตยกรรมไทย ภายในประดิษฐานพระคเณศ ซึ่งออกแบบและปั้นหล่อโดยอาจารย์เสวต เทศน์ธรรม ประติมากรอาวุโส ศิษย์ท่านศาสตราจารย์ศิลป์ พีระศรี ด้านหน้าเทวาลัยมีอาคารนิทรรศการและจำหน่ายของที่ระลึก ภายในอาคารมีการจัดนิทรรศการการประวัติจัดสร้างพระคเณศประจำมหาวิทยาลัย รวมทั้งเช่าบูชาพระคเณศ"
        },
        {
          "yaw": 1.9289631799548443,
          "pitch": -0.03867675135952098,
          "title": "<font face=\"TH Sarabun New, sans-serif\"><span style=\"font-size: 21.3333px;\"><b>สวนประติมากรรม&nbsp;</b></span></font>",
          "text": "ลานกลางแจ้ง แหล่งรวมผลงานประติมากรรมจากการประกวดศิลปกรรมแห่งชาติ กลายเป็นจุดเช็คอินและใช้จัดกิจกรรมทางด้านศิลปะและบันเทิงของมหาวิทยาลัย"
        }
      ]
    },
    {
      "id": "9-map08_p360_pb001",
      "name": "MAP08_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -0.8243333483668458,
        "pitch": -0.05936728551900572,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": 3.0944296108459843,
          "pitch": -0.004117286298754408,
          "rotation": 0,
          "target": "8-map07_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.5753351949522383,
          "pitch": -0.06621056250885893,
          "title": "อาคารสถาบันศิลปะสถาปัตยกรรมไทยเฉลิมพระเกียรติ",
          "text": "เดิมเป็นอาคารของคณะสถาปัตยกรรมศาสตร์ ออกแบบโดยอาจารย์วนิดา พึ่งสุนทร ศิลปินแห่งชาติ ปัจจุบันยังไม่มีการใช้งาน กำกับดูแลอาคารโดยสำนักศิลปวัฒนธรรม"
        },
        {
          "yaw": -0.13102583806423418,
          "pitch": -0.03547383930997938,
          "title": "อาคารโอทอป",
          "text": "หนึ่งในพื้นที่สำหรับเตรียมงานกิจกรรมนักศึกษา"
        }
      ]
    },
    {
      "id": "10-map09_p360_pb001",
      "name": "MAP09_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 3.1187609772864517,
        "pitch": -0.014132058431416183,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": -2.920048958897981,
          "pitch": 0.008100596269239091,
          "rotation": 0,
          "target": "7-map06_p360_pb001"
        },
        {
          "yaw": 1.5493151538875196,
          "pitch": 0.028784941929558272,
          "rotation": 0,
          "target": "14-map13_p360_pb001"
        },
        {
          "yaw": -0.1385797835597451,
          "pitch": -0.027449621042158867,
          "rotation": 0,
          "target": "8-map07_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.5940707207280536,
          "pitch": -0.023510974902338333,
          "title": "อาคารเรียนรวม 2",
          "text": "ใช้สำหรับการเรียนการสอน ภายในมีห้องจัดแสดงประติมากรรม ชื่อว่า ‘ห้องศิลป์สร้างสรรค์’ และห้องประชุมขนาดใหญ่ของวิทยาเขตความจุ 250 ที่นั่ง&nbsp;"
        }
      ]
    },
    {
      "id": "11-map10_p360_pb001",
      "name": "MAP10_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -2.4488990840717744,
        "pitch": -0.03125410245458404,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": -0.08513657056052892,
          "pitch": -0.02844880151925011,
          "rotation": 0,
          "target": "7-map06_p360_pb001"
        },
        {
          "yaw": -3.128581170869225,
          "pitch": 0.02371412909585935,
          "rotation": 0,
          "target": "15-map14_p360_pb001"
        },
        {
          "yaw": -1.57860732087053,
          "pitch": 0.0013380257816812957,
          "rotation": 0,
          "target": "13-map12_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.5692914072265314,
          "pitch": -0.22453467457399157,
          "title": "อาคารบริหาร",
          "text": "ที่ตั้งสำนักงานของวิทยาเขตและคณะวิชา ประกอบด้วย สำนักงานกองงานวิทยาเขต คณะสัตวศาสตร์และเทคโนโลยีการเกษตร คณะเทคโนโลยีสารสนเทศและการสื่อสาร และคณะสหเวชศาสตร์&nbsp;"
        }
      ]
    },
    {
      "id": "12-map11_p360_pb001",
      "name": "MAP11_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 1.3402798542265355,
        "pitch": -0.10018443279072287,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": 2.221798683436706,
          "pitch": -0.01329091436469021,
          "rotation": 0,
          "target": "7-map06_p360_pb001"
        },
        {
          "yaw": -2.4911923590559404,
          "pitch": 0.023740102398967622,
          "rotation": 0,
          "target": "13-map12_p360_pb001"
        },
        {
          "yaw": 0.6514852903961383,
          "pitch": -0.028362856292883265,
          "rotation": 0,
          "target": "5-map04_p360_pb001"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "13-map12_p360_pb001",
      "name": "MAP12_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -2.251037741900646,
        "pitch": -0.012986216088801683,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": -2.9807032778158096,
          "pitch": 0.011043907918296014,
          "rotation": 0,
          "target": "12-map11_p360_pb001"
        },
        {
          "yaw": -1.3520872692654446,
          "pitch": 0.003768755516221134,
          "rotation": 0,
          "target": "11-map10_p360_pb001"
        },
        {
          "yaw": 0.23696948896048475,
          "pitch": -0.031048225603235835,
          "rotation": 0,
          "target": "17-map18_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.3481268555266688,
          "pitch": -0.1995688622092029,
          "title": "อาคารบริหาร",
          "text": "ที่ตั้งสำนักงานของวิทยาเขตและคณะวิชา ประกอบด้วย สำนักงานกองงานวิทยาเขต คณะสัตวศาสตร์และเทคโนโลยีการเกษตร คณะเทคโนโลยีสารสนเทศและการสื่อสาร และคณะสหเวชศาสตร์&nbsp;"
        },
        {
          "yaw": 1.779061130173985,
          "pitch": -0.17158988817526222,
          "title": "อนุสาวรีย์ศาสตราจารย์ศิลป์ พีระศรี",
          "text": "<div>บิดาแห่งศิลปะสมัยใหม่ของไทย ผู้ก่อตั้งมหาวิทยาลัยศิลปากร&nbsp; อนุสาวรีย์ตั้งอยู่ ณ บริเวณด้านหลังอาคารบริหาร&nbsp;&nbsp;</div><div>เพื่อเป็นการเผยแพร่เกียรติประวัติและปลูกฝังความรักความศรัทธาในผู้มีพระคุณของสถาบันการศึกษา</div><div><br></div>"
        },
        {
          "yaw": -1.9816106145686074,
          "pitch": -0.048252928326952826,
          "title": "สวนศิลป์สร้างสรรค์",
          "text": "พื้นที่พักผ่อนของนักศึกษาและบุคลากร"
        }
      ]
    },
    {
      "id": "14-map13_p360_pb001",
      "name": "MAP13_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 2.036515807540745,
        "pitch": -0.03751795054206575,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": -1.7530750883564163,
          "pitch": 0.042845142669381886,
          "rotation": 0,
          "target": "10-map09_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.1904121937795509,
          "pitch": -0.027264677362465406,
          "title": "อาคารโอทอป",
          "text": "หนึ่งในพื้นที่สำหรับเตรียมงานกิจกรรมนักศึกษา"
        },
        {
          "yaw": 2.5640130623665467,
          "pitch": -0.00042261910424734594,
          "title": "โรงอาหารกลาง&nbsp;",
          "text": "โรงอาหารกลางมหาวิทยาลัยศิลปากร"
        }
      ]
    },
    {
      "id": "15-map14_p360_pb001",
      "name": "MAP14_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 2.593525800690802,
        "pitch": -0.12328264163359215,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": -1.104956775077195,
          "pitch": -0.011658380665750201,
          "rotation": 0,
          "target": "11-map10_p360_pb001"
        },
        {
          "yaw": 2.021547728825599,
          "pitch": 0.004528729084379179,
          "rotation": 0,
          "target": "16-map15_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.6855534904360034,
          "pitch": 0.04351998256531253,
          "title": "อาคารเรียนรวม 1",
          "text": "ที่ตั้งของสำนักงานคณะวิทยาการจัดการ ห้องเรียนและห้องปฎิบัติการต่าง ๆ&nbsp;"
        }
      ]
    },
    {
      "id": "16-map15_p360_pb001",
      "name": "MAP15_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 0.9782607430905337,
        "pitch": 0.08413248353937419,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": 0.38277513652086803,
          "pitch": -0.006621863477539236,
          "rotation": 0,
          "target": "17-map18_p360_pb001"
        },
        {
          "yaw": 1.9737977283297905,
          "pitch": 0.029134789909615932,
          "rotation": 0,
          "target": "15-map14_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.0725486741200747,
          "pitch": -0.01652742846944122,
          "title": "อาคารผลิตน้ำประปา&nbsp;",
          "text": "โรงผลิตน้ำประปาภายใน­ของมหาวิทยาลัยเพื่อให้เพียงพอต่อความต้องการและสร้างความยั่งยืน"
        }
      ]
    },
    {
      "id": "17-map18_p360_pb001",
      "name": "MAP18_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -0.8744547072812576,
        "pitch": 0.03547207599761926,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": 1.8224160925353088,
          "pitch": -0.00799956069425889,
          "rotation": 0,
          "target": "16-map15_p360_pb001"
        },
        {
          "yaw": -1.3617875495897458,
          "pitch": -0.016057529878867882,
          "rotation": 0,
          "target": "18-map17_p360_pb001"
        },
        {
          "yaw": 0.07620407540349738,
          "pitch": 0.02609483884568853,
          "rotation": 0,
          "target": "13-map12_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.8344222985309706,
          "pitch": 0.009953469804379722,
          "title": "ศูนย์เศรษฐกิจพอเพียง&nbsp;",
          "text": "พื้นที่ทดลองทำการเกษตรเพื่อสนับสนุนงานเกษตรกรรมของชุมชน&nbsp;"
        },
        {
          "yaw": -1.6332017656464117,
          "pitch": -0.0125866911767325,
          "title": "หอพัก 1",
          "text": "&nbsp;ปิดอยู่"
        },
        {
          "yaw": -0.05955174954831399,
          "pitch": -0.0162398942475388,
          "title": "อาคารวิทยบริการ&nbsp;",
          "text": "ประกอบด้วยสำนักหอสมุดวิทยาเขตเพชรบุรี สำนักดิจิทัล ห้องเรียนและห้องบรรยายสำหรับจัดการเรียนการสอน"
        }
      ]
    },
    {
      "id": "18-map17_p360_pb001",
      "name": "MAP17_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 2.454798134258011,
        "pitch": -0.011755061965622815,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": -0.855408930192775,
          "pitch": 0.018666141639798184,
          "rotation": 0,
          "target": "17-map18_p360_pb001"
        },
        {
          "yaw": 2.4997253332282074,
          "pitch": -0.0011575316694365512,
          "rotation": 0,
          "target": "19-map19_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 3.1339839037136192,
          "pitch": 0.018232258689010905,
          "title": "ถนนประติมากรรม&nbsp;",
          "text": "เป็นพื้นที่แสดงศิลปะกลางแจ้งที่โดดเด่น จัดแสดงผลงานประติมากรรมเซรามิกจากศิลปินระดับโลกและศิลปินไทย โดยเฉพาะโครงการ Silpakorn Clay Works ที่เปลี่ยนภูมิทัศน์มหาวิทยาลัยให้เป็นถนนสายศิลปะ ผสมผสานธรรมชาติและงานสร้างสรรค์ไว้ด้วยกัน&nbsp;"
        },
        {
          "yaw": -2.4743015147659086,
          "pitch": -0.021876110495337997,
          "title": "อาคารสหเวชศาสตร์และอาคารกายวิภาค&nbsp;",
          "text": "อยู่ในระหว่างการปรับปรุง (เดิมคืออาคารโบราณคดี)"
        },
        {
          "yaw": -0.0026372261662981344,
          "pitch": 0.0031514149113611722,
          "title": "<p style=\"margin-top: 12px; margin-bottom: 12px;\">หอพักบุคลากร&nbsp;</p>",
          "text": "หอพักอาศัยสำหรับบุคลากรในมหาวิทยาลัย"
        }
      ]
    },
    {
      "id": "19-map19_p360_pb001",
      "name": "MAP19_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": 1.7306421101695157,
        "pitch": -0.07135240375382068,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": -1.4796238488952227,
          "pitch": -0.014260399069234708,
          "rotation": 0,
          "target": "18-map17_p360_pb001"
        },
        {
          "yaw": 1.9304227954918254,
          "pitch": -0.01242001105728896,
          "rotation": 0,
          "target": "20-map20_p360_pb001"
        },
        {
          "yaw": 0.03551435080668952,
          "pitch": -0.0066574350424559725,
          "rotation": 0,
          "target": "6-map05_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.0395129538951018,
          "pitch": -0.007490615688974245,
          "title": "ตึกยานยนต์&nbsp;",
          "text": "พื้นที่ใช้งานในการจัดการเรียนการสอนและกิจกรรมของคณะเทคโนโลยีสารสนเทศและการสื่อสาร&nbsp;"
        }
      ]
    },
    {
      "id": "20-map20_p360_pb001",
      "name": "MAP20_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -2.551489518021272,
        "pitch": -0.10739936107811765,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": 1.0097739434365707,
          "pitch": 0.007665080978464189,
          "rotation": 0,
          "target": "19-map19_p360_pb001"
        },
        {
          "yaw": -1.8617112325520466,
          "pitch": -0.011589400236672986,
          "rotation": 0,
          "target": "21-map21_p360_pb001"
        },
        {
          "yaw": 2.860439277303607,
          "pitch": -0.01384074256444734,
          "rotation": 0,
          "target": "20-map20_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.3849702005737523,
          "pitch": -0.015666773650702126,
          "title": "สระศิลป์เพชรภิรมย์",
          "text": "มีอีกชื่อว่าบ่อปลาวาฬ เป็นพื้นที่กักเก็บน้ำและสถานที่พักผ่อนหย่อนใจ&nbsp;"
        }
      ]
    },
    {
      "id": "21-map21_p360_pb001",
      "name": "MAP21_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -0.2967059728390442,
        "pitch": -0.16697405465120596,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": 2.2573153644181048,
          "pitch": -0.012895439112034168,
          "rotation": 0,
          "target": "20-map20_p360_pb001"
        },
        {
          "yaw": -0.3823228548238724,
          "pitch": 0.0310634302564754,
          "rotation": 0,
          "target": "22-map22_p360_pb001"
        },
        {
          "yaw": -1.82875576146618,
          "pitch": -0.0012257960039008253,
          "rotation": 0,
          "target": "23-map24_p360_pb001"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "22-map22_p360_pb001",
      "name": "MAP22_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -2.6576284396509156,
        "pitch": 0.07118200677390085,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": -0.23896166967688615,
          "pitch": 0.04159777082151983,
          "rotation": 0,
          "target": "21-map21_p360_pb001"
        },
        {
          "yaw": 3.0253322427802303,
          "pitch": -0.0027868992620554423,
          "rotation": 0,
          "target": "29-map30_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.6958421171561504,
          "pitch": -0.1801989290269823,
          "title": "อาคารปฎิบัติการคณะสัตว์สาสตร์และเทคโนโลยีการเกษตร",
          "text": "เป็นอาคารสูง4ชั้นที่รวมห้องปฎิบัติการทางวิทยาศาสตร์และเทคโนโลยีทางการเกษตรไว้อย่างครบวงจรเพื่อรองรับการเรียนการสอนและงานวิจัย&nbsp;"
        }
      ]
    },
    {
      "id": "23-map24_p360_pb001",
      "name": "MAP24_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.6095492292385574,
          "pitch": 0.005798482957072082,
          "rotation": 0,
          "target": "24-map23_p360_pb001"
        },
        {
          "yaw": -1.481618399835611,
          "pitch": -0.012389759237223075,
          "rotation": 0,
          "target": "21-map21_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.4198700912712603,
          "pitch": -0.031197733026088414,
          "title": "อาคาร K Common",
          "text": "พื้นที่ co-working space ของนักศึกษาและบุคลากร สนับสนุนโดยธนาคารกสิกรไทย&nbsp;"
        }
      ]
    },
    {
      "id": "24-map23_p360_pb001",
      "name": "MAP23_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.03814394287906708,
          "pitch": 0.06206076708131825,
          "rotation": 0,
          "target": "23-map24_p360_pb001"
        },
        {
          "yaw": 1.568067200410269,
          "pitch": 0.023122972334746805,
          "rotation": 0,
          "target": "25-map26_p360_pb001"
        },
        {
          "yaw": -1.6099973239154224,
          "pitch": -0.028423642358641033,
          "rotation": 0,
          "target": "28-map28_p360_pb001"
        },
        {
          "yaw": 3.0851350971375737,
          "pitch": 0.004663156966632442,
          "rotation": 0,
          "target": "31-map31_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.192475760711961,
          "pitch": 0.040933321454964755,
          "title": "ลานจันทร์&nbsp;",
          "text": "<div>พื้นที่จัดกิจกรรมกลางแจ้งหลักของวิทยาเขตสารสนเทศเพชรบุรี ใช้สำหรับรวมตัวนักศึกษาและจัดงานประเพณีต่าง ๆ เช่น กิจกรรมหอพัก และจัดกิจกรรมใส่บาตรเป็นประจำทุกวันพุธและวันพระ&nbsp;</div><div><br></div>"
        },
        {
          "yaw": -2.6171965046027346,
          "pitch": 0.025442579560039036,
          "title": "อาคารกิจกรรมและนันทนาการ",
          "text": "ศูนย์กลางกิจกรรมและการใช้ชีวิตของนักศึกษา ภายในอาคารมีร้านรักษ์โลก SU Refill, ไปรษณีย์อนุญาต พื้นที่สภานักศึกษา องค์การนักศึกษา สโมสรนักศึกษา และศูนย์สุขภาวะศิลป์ ชั้น 2 เป็นพื้นที่สำนักงานพัฒนานักศึกษา ห้องอ่านหนังสือ ห้องกิจกรรม และ ‘ห้องเพิ่มสุข’ สำหรับให้คำปรึกษาด้านจิตวิทยา ชั้น 3–4 รองรับกิจกรรมกีฬาและนันทนาการ เช่น ฟิตเนส ปิงปอง เทควันโด โยคะ ห้องซ้อมดนตรี ห้องซ้อมเต้น ห้องหมากกระดาน และพื้นที่อ่านหนังสือ บนดาดฟ้าติดตั้งระบบโซลาร์เซลล์ เพื่อสนับสนุนการใช้พลังงานอย่างยั่งยืนภายในอาคาร&nbsp;"
        },
        {
          "yaw": -1.005168765869394,
          "pitch": -0.010717832149008899,
          "title": "ลานจอดรถ",
          "text": "พื้นที่อเนกประสงค์ขนาดใหญ่สำหรับจัดกิจกรรมต่าง ๆ รวมทั้งตลาดนัดวันจันทร์"
        }
      ]
    },
    {
      "id": "25-map26_p360_pb001",
      "name": "MAP26_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.0373126328596207,
          "pitch": -0.019939601762724024,
          "rotation": 0,
          "target": "24-map23_p360_pb001"
        },
        {
          "yaw": -2.06395440149994,
          "pitch": -0.0018176039122508314,
          "rotation": 0,
          "target": "26-map25_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.614263764380709,
          "pitch": -0.02165974501910206,
          "title": "กลุ่มอาคารหอพักนักศึกษา",
          "text": "ประกอบด้วยอาคารที่พัก 5 อาคารและห้องพยาบาล&nbsp;"
        }
      ]
    },
    {
      "id": "26-map25_p360_pb001",
      "name": "MAP25_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 3.0914005098150916,
          "pitch": 0.00669210610868376,
          "rotation": 0,
          "target": "25-map26_p360_pb001"
        },
        {
          "yaw": -0.31015355032378444,
          "pitch": 0.014816173072814465,
          "rotation": 0,
          "target": "27-map27_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.09014632505446585,
          "pitch": 0.08826187749986403,
          "title": "ตลาดเพลินศิลป์",
          "text": "มีอีกชื่อเรียกว่าตลาดจิ๋มมด เป็นตลาดหลังหอพักนักศึกษา เปิดให้บริการตั้งแต่เวลา 15.30 น. (ยกเว้นวันจันทร์) ซึ่งเป็นแหล่งรวมร้านอาหารยอดนิยมในราคานักศึกษา บริเวณด้านหลังหอพักนักศึกษา&nbsp; 5-6&nbsp;"
        }
      ]
    },
    {
      "id": "27-map27_p360_pb001",
      "name": "MAP27_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.54539451354038,
          "pitch": -0.011770564947305218,
          "rotation": 0,
          "target": "26-map25_p360_pb001"
        },
        {
          "yaw": -2.0911165568209604,
          "pitch": -0.016397249837590167,
          "rotation": 0,
          "target": "20-map20_p360_pb001"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "28-map28_p360_pb001",
      "name": "MAP28_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.749847658693996,
          "pitch": -0.01823226698621916,
          "rotation": 0,
          "target": "24-map23_p360_pb001"
        },
        {
          "yaw": 1.9211335965020169,
          "pitch": 0.005556677399262355,
          "rotation": 0,
          "target": "29-map30_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.6806098119532962,
          "pitch": 0.013049780769460284,
          "title": "อาคารกิจกรรมและนันทนาการ",
          "text": "ศูนย์กลางกิจกรรมและการใช้ชีวิตของนักศึกษา ภายในอาคารมีร้านรักษ์โลก SU Refill, ไปรษณีย์อนุญาต พื้นที่สภานักศึกษา องค์การนักศึกษา สโมสรนักศึกษา และศูนย์สุขภาวะศิลป์ ชั้น 2 เป็นพื้นที่สำนักงานพัฒนานักศึกษา ห้องอ่านหนังสือ ห้องกิจกรรม และ ‘ห้องเพิ่มสุข’ สำหรับให้คำปรึกษาด้านจิตวิทยา ชั้น 3–4 รองรับกิจกรรมกีฬาและนันทนาการ เช่น ฟิตเนส ปิงปอง เทควันโด โยคะ ห้องซ้อมดนตรี ห้องซ้อมเต้น ห้องหมากกระดาน และพื้นที่อ่านหนังสือ บนดาดฟ้าติดตั้งระบบโซลาร์เซลล์ เพื่อสนับสนุนการใช้พลังงานอย่างยั่งยืนภายในอาคาร&nbsp;"
        },
        {
          "yaw": 1.4164761221516873,
          "pitch": 0.02252872790241156,
          "title": "ลานกีฬากลางแจ้ง",
          "text": "ลานกีฬากลางแจ้งของมหาวิทยาลัย"
        },
        {
          "yaw": 0.9667918350597482,
          "pitch": -0.024364340492125436,
          "title": "โรงพละศึกษา",
          "text": "ศูนย์กลางการจัดกิจกรรมอเนกประสงค์ที่รองรับทั้งงานบันเทิงและกีฬาอย่างเต็มรูปแบบ"
        },
        {
          "yaw": 2.889554119360916,
          "pitch": 0.00023650091467430912,
          "title": "ลานจอดรถ&nbsp;",
          "text": "พื้นที่อเนกประสงค์ขนาดใหญ่สำหรับจัดกิจกรรมต่าง ๆ รวมทั้งตลาดนัดวันจันทร์"
        }
      ]
    },
    {
      "id": "29-map30_p360_pb001",
      "name": "MAP30_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -1.5298091193838292,
        "pitch": 0.16944169636265016,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": 2.72986553103042,
          "pitch": -0.02868730884645565,
          "rotation": 0,
          "target": "28-map28_p360_pb001"
        },
        {
          "yaw": 1.107406892003329,
          "pitch": -0.0034666288535518675,
          "rotation": 0,
          "target": "22-map22_p360_pb001"
        },
        {
          "yaw": -1.1461785924583996,
          "pitch": -0.010598012004029655,
          "rotation": 0,
          "target": "30-map29_p360_pb001"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "30-map29_p360_pb001",
      "name": "MAP29_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "yaw": -1.5457351888175364,
        "pitch": -0.0350439373959297,
        "fov": 1.38217411905719
      },
      "linkHotspots": [
        {
          "yaw": 1.9606009631863088,
          "pitch": 0.0012305067478628473,
          "rotation": 0,
          "target": "29-map30_p360_pb001"
        },
        {
          "yaw": -1.1767116760454908,
          "pitch": -0.01992437578357631,
          "rotation": 0,
          "target": "5-map04_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.7492270901827904,
          "pitch": -0.014577005554885503,
          "title": "สนามฟุตบอล",
          "text": "สนามฟุตบอลกลางแจ้งภายในมหาวิทยาลัย"
        }
      ]
    },
    {
      "id": "31-map31_p360_pb001",
      "name": "MAP31_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.9529757845154885,
          "pitch": 0.02276824464636462,
          "rotation": 0,
          "target": "32-map32_p360_pb001"
        },
        {
          "yaw": -0.29257889927928815,
          "pitch": -0.01656575218936851,
          "rotation": 0,
          "target": "24-map23_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.0017323934413653,
          "pitch": 0.09146705096110885,
          "title": "เส้นทางจักรยาน",
          "text": "เส้นทางจักรยานยนต์"
        },
        {
          "yaw": 2.604174641627563,
          "pitch": 0.02364519507741747,
          "title": "ประตูหลัง",
          "text": "<div>จุดเชื่อมต่อสำคัญระหว่างการเดินทางจากภายนอกเข้าสู่ระบบขนส่งภายในวิทยาเขต มีสถานีตำรวจสภ.ชะอำที่ช่วยอำนวยความสะดวก วินรถตู้โดยสาร สถานีรถรางไฟฟ้า จุดจอดรถมอเตอร์ไซค์ จุดจอด GOGO Bike (จักรยานไฟฟ้า)&nbsp;</div><div><br></div>"
        }
      ]
    },
    {
      "id": "32-map32_p360_pb001",
      "name": "MAP32_p360_pb001",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1944,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 2.0237712048419425,
          "pitch": 0.006825372433988619,
          "rotation": 0,
          "target": "31-map31_p360_pb001"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.4030975100585845,
          "pitch": 0.011578608457341488,
          "title": "ประตูหลัง&nbsp;",
          "text": "<div>จุดเชื่อมต่อสำคัญระหว่างการเดินทางจากภายนอกเข้าสู่ระบบขนส่งภายในวิทยาเขต มีสถานีตำรวจสภ.ชะอำที่ช่วยอำนวยความสะดวก วินรถตู้โดยสาร สถานีรถรางไฟฟ้า จุดจอดรถมอเตอร์ไซค์ จุดจอด GOGO Bike (จักรยานไฟฟ้า)&nbsp;</div><div><br></div>"
        }
      ]
    }
  ],
  "name": "Project Title",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": true,
    "fullscreenButton": true,
    "viewControlButtons": false
  }
};
